-- phpMyAdmin SQL Dump
-- version 5.0.2
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: May 19, 2020 at 04:59 AM
-- Server version: 10.4.11-MariaDB
-- PHP Version: 7.4.5

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `alert_bot`
--

-- --------------------------------------------------------

--
-- Table structure for table `alert`
--

CREATE TABLE `alert` (
  `alert_id` int(11) NOT NULL,
  `user_id` int(11) NOT NULL,
  `token_line_id` int(11) NOT NULL,
  `task_id` int(11) NOT NULL,
  `alert_date` date NOT NULL,
  `alert_time` time NOT NULL,
  `alert_type` int(11) NOT NULL COMMENT '0 = รอบ, 1 = ระบุวันที่',
  `alert_data_type` int(1) NOT NULL COMMENT '0 = จากฐานข้อมูล, 1 = กำหนดข้อความเอง',
  `file_name` varchar(255) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `status` int(1) NOT NULL DEFAULT 1 COMMENT '0 = ปิด, 1 = เปิด',
  `alert_text` varchar(255) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `insert_record_date` datetime NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `alert`
--

INSERT INTO `alert` (`alert_id`, `user_id`, `token_line_id`, `task_id`, `alert_date`, `alert_time`, `alert_type`, `alert_data_type`, `file_name`, `status`, `alert_text`, `insert_record_date`) VALUES
(1, 666, 1, 1, '2020-05-18', '22:02:38', 0, 0, '1589813816808_export_task_award.html', 0, 'แจ้งเตือนงาน: award จำนวนรายการ: 2 รายการ', '2020-05-18 22:02:08');

-- --------------------------------------------------------

--
-- Table structure for table `alert_update_datetime`
--

CREATE TABLE `alert_update_datetime` (
  `id` int(11) NOT NULL,
  `alert_id` int(11) NOT NULL,
  `time_type` varchar(10) COLLATE utf8_unicode_ci NOT NULL,
  `time_value` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Dumping data for table `alert_update_datetime`
--

INSERT INTO `alert_update_datetime` (`id`, `alert_id`, `time_type`, `time_value`) VALUES
(1, 1, 's', 30);

-- --------------------------------------------------------

--
-- Table structure for table `award`
--

CREATE TABLE `award` (
  `table_name_id` int(11) NOT NULL,
  `h1` int(11) NOT NULL,
  `h2` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `h3` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `h4` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `h5` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `h6` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `h7` varchar(255) COLLATE utf8_unicode_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Dumping data for table `award`
--

INSERT INTO `award` (`table_name_id`, `h1`, `h2`, `h3`, `h4`, `h5`, `h6`, `h7`) VALUES
(1, 84, 'The Development of Augmented Reality to the KING’S Philosophy about the KING’S Work.', 'นางสาว', 'ญาณิศา ศิริเม็งราช', 'มหาวิทยาลัยราชภัฏมหาสารคาม', 'Oral', 'Good'),
(2, 85, 'The Development Motion Graphic to Promote Cultural Tourism in Roi Et Province.', 'นาย', 'ปัฐวีกรณ์ มาขุมเหล็ก', 'มหาวิทยาลัยราชภัฏมหาสารคาม', 'Oral', 'Good'),
(3, 86, 'The Development of Augmented Reality to Promote Tourism Mukdahan Province', 'นางสาว', 'ฤทัยรัตน์ ภูดี', 'มหาวิทยาลัยราชภัฏมหาสารคาม', 'Oral', 'Good'),
(4, 87, 'The Development of Motion Graphic : Merit Route Northeastern Buddhist Residence, Mahasarakham Province', 'นางสาว', 'ณิชา ทุมนาม', 'มหาวิทยาลัยราชภัฏมหาสารคาม', 'Oral', 'Good'),
(5, 92, 'เว็บไซต์การท่องเที่ยววิถีชุมชนกับภูมิปัญญาท้องถิ่น  อำเภอพระพรหม จังหวัดนครศรีธรรมราช ', 'นางสาว', 'รัตนาวลี สกุลหนู ', 'มหาวิทยาลัยเทคโนโลยีราชมงคลศรีวิชัย วิทยาเขตนครศรีธรรมราช', 'Poster', 'Very Good'),
(6, 93, 'การออกแบบและพัฒนาเว็บไซต์เพื่ออนุรักษ์พิธีกรรมในลุ่มน้ำปากพนัง', 'นาย', 'พงศธร สุทธิแป้น', 'มหาวิทยาลัยเทคโนโลยีราชมงคลศรีวิชัย วิทยาเขตนครศรีธรรมราช', 'Poster', 'Good'),
(7, 94, 'ระบบจัดการคลังน้ำดื่ม กรณีศึกษาโรงผลิตน้ำดื่มชุมชนบ้านกลางเหนือ', 'นางสาว', 'ดวงฤดี เฉี้ยนเงิน', 'มหาวิทยาลัยเทคโนโลยีราชมงคลศรีวิชัย วิทยาเขตนครศรีธรรมราช', 'Poster', 'Good'),
(8, 95, 'The system checks the Cataract, Pterygium and Pinguecula preliminary yourself', 'นาย', 'ปรีชัย ขันหลวง', 'มหาวิทยาลัยนเรศวร', 'Oral', 'Very Good'),
(9, 96, 'การประยุกต์ใช้ระบบการจัดการเนื้อหาบนเว็บไซต์ในการพัฒนาเส้นทางท่องเที่ยวเชิงเกษตร จังหวัดสงขลา', 'นางสาว', 'สุดารัตน์ กรดสีใหม่', 'มหาวิทยาลัยเทคโนโลยีราชมงคลศรีวิชัย วิทยาเขตนครศรีธรรมราช', 'Poster', 'Very Good'),
(10, 97, 'การพัฒนาระบบร้านวินเทจเฮาส์เฟอร์นิเจอร์ยุโรป', 'นางสาว', 'ณัฏฐธิดา สังข์ชุม,กาญจนา นามวงษ์ และ อซีซะ รัตน์พงศ์ อภิชัย จันทร์อุดม และ จุฑาภรณ์ เลิศไกร', 'มหาวิทยาลัยเทคโนโลยีราชมงคลศรีวิชัย วิทยาเขตนครศรีธรรมราช', 'Poster', 'Very Good'),
(11, 99, 'Checking multiple choice System', 'นาย', 'ปฏิมา รุ่งฉวี', 'มหาวิทยาลัยนเรศวร', 'Oral', 'Very Good'),
(12, 100, 'ระบบการจัดการข้อมูลผลงานนิสิต คณะวิทยาศาสตร์และสังคมศาสตร์ มหาวิทยาลัยบูรพา วิทยาเขตสระแก้ว', 'นาย', 'สรวิศ ผ่องศรี', 'มหาวิทยาลัยบูรพา วิทยาเขตสระแก้ว', 'Poster', 'Very Good'),
(13, 101, 'ระบบการจัดการข้อมูลการคงอยู่ของนิสิต คณะวิทยาศาสตร์และสังคมศาสตร์ มหาวิทยาลัยบูรพา วิทยาเขตสระแก้ว', 'นาย', 'สรวิศ ผ่องศรี', 'มหาวิทยาลัยบูรพา วิทยาเขตสระแก้ว', 'Poster', 'Good'),
(14, 104, 'Find a clinic based on Facebook Social Network data: (A case study of Phitsanulok)', 'นาย', 'อตรีลักษณ์ ศรีเพ็ง', 'มหาวิทยาลัยนเรศวร', 'Oral', 'Very Good'),
(15, 105, 'การพัฒนาสื่อมัลติมีเดีย 3 มิติ เพื่อรณรงค์การใช้ถุงยางอนามัย', '', 'ภคนันท์ ศาสตระวาทิต', 'มหาวิทยาลัยราชภัฏจันทรเกษม', 'Poster', 'Good'),
(16, 107, 'โปรแกรมชุดตรวจลักษณะการเดินเพื่อนสนับสนุนการแพทย์', 'นาย', 'พัชระพงษ์ ผุยหนองโพธิ์', 'สถาบันเทคโนโลยีพระจอมเกล้าเจ้าคุณทหารลาดกระบัง', 'Oral', 'Very Good'),
(17, 113, 'ระบบบริหารคลังสินค้า กรณีศึกษา บริษัท ชิน จำกัด', 'นาย', 'เอกรินทร์ ตั้งนิธิบุญ', 'มหาวิทยาลัยราชภัฏธนบุรี', 'Oral', 'Excellence'),
(18, 114, 'Arduino-based Educational Robotics with Android Mobile Application', 'นาย', 'สุรศักดิ์ อาจญาทา', 'มหาวิทยาลัยนเรศวร', 'Oral', 'Very Good'),
(19, 115, 'Low-cost Projection Mapping Technique for 3D Objects', 'นางสาว ', 'ทิพย์ภาพร รัศมี', 'มหาวิทยาลัยนเรศวร', 'Oral', 'Good'),
(20, 116, 'Smart Green Gift Prototype', 'นาย', 'วงศพัทธ์ เกตุมาก', 'มหาวิทยาลัยเทคโนโลยีราชมงคลสุวรรณภูมิ ศูนย์สุพรรณบุรี', 'Poster', 'Good'),
(21, 120, 'The Analysis System of Sweet Tamarind Quality with Deep Learning', 'นาย', 'นพรัตน์ คำทิพย์', 'มหาวิทยาลัยนเรศวร', 'Oral', 'Excellence'),
(22, 121, 'ระบบวิเคราะห์ชนิดสายพันธุ์ผลไม้ด้วยเทคนิคการประมวลผลภาพ', 'นางสาว', 'นันทนา แดงซิว', 'มหาวิทยาลัยนเรศวร', 'Oral', 'Good'),
(23, 128, 'Website Management System for Food Entrepreneur Program Bansomdejchaopraya Rajabhat University', 'นางสาว', 'นิศากร เถาสมบัติ', 'มหาวิทยาลัยราชภัฏบ้านสมเด็จเจ้าพระยา ', 'Oral', 'Good'),
(24, 129, 'The Designing Game for development skills for olderly people', 'นาย', 'จักรพรรณ์ ลือนาม', 'มหาวิทยาลัยราชภัฏบ้านสมเด็จเจ้าพระยา ', 'Oral', 'Very Good'),
(25, 130, 'เกม 2 มิติ ฮาร์ดแวร์ ดิ แอดเวนเจอร์ Hardware The Adventure 2D Game ', 'นาย', 'ภัทรพงษ์ แสนทวีสุข', 'มหาวิทยาลัยราชภัฏอุบลราชธานี', 'Oral', 'Good'),
(26, 132, 'ระบบตรวจวัดระดับน้ำในถังเก็บน้ำภายในอาคาร', 'นาย', 'ศราวุธ บัวเขียว', 'มหาวิทยาลัยราชภัฏอุบลราชธานี', 'Oral', 'Very Good'),
(27, 133, 'ระบบจัดเก็บค่าน้ำประปาหมู่ 5 บ้านคอนสาย   ตำบลคอนสาย อำเภอตระการพืชผล จังหวัดอุบลราชธานี', 'นางสาว', 'กิตติมาภรณ์ ชาวกระเดียน', 'มหาวิทยาลัยราชภัฏอุบลราชธานี', 'Oral', 'Good'),
(28, 138, 'แอปพลิเคชันค้นหาช่างซ่อมอุปกรณ์ไฟฟ้าในเขตกรุงเทพมหานคร', 'นาย', 'ทศพร สุภนิกร', 'มหาวิทยาลัยราชภัฏบ้านสมเด็จเจ้าพระยา ', 'Oral', 'Good'),
(29, 139, 'ระบบบริหารจัดการร้านกระบองเพชร', 'นาย', 'อดิศร  ระหาญนอก', 'มหาวิทยาลัยราชภัฏบ้านสมเด็จเจ้าพระยา ', 'Oral', 'Good'),
(30, 140, 'ระบบยืม-คืนอุปกรณ์ด้วยเทคโนโลยี QR Code สาขาวิศวกรรมไฟฟ้า', 'นางสาว', 'มณีวรรณ ตาดำ', 'มหาวิทยาลัยเทคโนโลยีราชมงคลตะวันออก วิทยาเขตจันทบุรี', 'Poster', 'Very Good'),
(31, 142, 'Fun Shadow Game to Practice Memory Skills for Kids 5-7 years', 'นาย', 'บุญญฤทธิ์ ศรีนาค ', 'มหาวิทยาลัยเทคโนโลยีราชมงคลสุวรรณภูมิ ศูนย์สุพรรณบุรี', 'Oral', 'Good'),
(32, 144, 'IOT Smoke and Intruder Monitoring System', 'นาย', 'พุฒินาท มูลอนันต์', 'มหาวิทยาลัยเทคโนโลยีราชมงคลตะวันออก วิทยาเขตจักรพงษภูวนารถ', 'Oral', 'Good'),
(33, 148, 'การใช้แนวคิด CI ด้วย Jenkins แบบ Descriptive Script', 'นาย', 'พัฒนพิสิทธิ์ อินต๊ะ', 'มหาวิทยาลัยบูรพา วิทยาเขตชลบุรี', 'Oral', 'Excellence'),
(34, 150, 'Vocabulary Game to Skills for Prathomsuksa 4 – 6', 'นางสาว', 'ภัทรา รูปวิเชตร์', 'มหาวิทยาลัยเทคโนโลยีราชมงคลสุวรรณภูมิ ศูนย์สุพรรณบุรี', 'Oral', 'Very Good'),
(35, 153, 'Multimedia Mathematical Math Games for Prathomsuksa 1', 'นางสาว', 'อุษณี เทพณรงค์', 'มหาวิทยาลัยเทคโนโลยีราชมงคลสุวรรณภูมิ ศูนย์สุพรรณบุรี', 'Oral', 'Very Good'),
(36, 154, 'Fun multimedia English game for prathomsuksa 1', 'นาย', 'วรดล ไววิทยะ', 'มหาวิทยาลัยเทคโนโลยีราชมงคลสุวรรณภูมิ ศูนย์สุพรรณบุรี', 'Oral', 'Very Good'),
(37, 155, 'แอปพลิเคชันบันทึกรักการอ่าน', 'นาย', 'ชาญณรงค์ ยะลา', 'มหาวิทยาลัยราชภัฏจันทรเกษม', 'Oral', 'Very Good'),
(38, 156, 'ระบบบริหารจัดการรับสั่งทำป้ายไวนิล กรณีศึกษา บจก.ร้านแชมป์อิงค์เจ็ท', 'นาย', 'สุดหล้า เสนาลา', 'มหาวิทยาลัยบูรพา วิทยาเขตสระแก้ว', 'Poster', 'Good'),
(39, 160, 'แอปพลิเคชันพระราชประวัติพระมหากษัตริย์ไทยสมัยรัตนโกสินทร์', 'นาย', 'วศิน นารัตฐา', 'มหาวิทยาลัยราชภัฏจันทรเกษม', 'Oral', 'Good'),
(40, 162, 'เว็บไซต์เช่ารถจักรยานยนต์ออนไลน์', 'นางสาว', 'ศิริเนตร สิทธิธรรม', 'มหาวิทยาลัยราชภัฏอุบลราชธานี', 'Oral', 'Good'),
(41, 163, 'ระบบการจัดการหอพักสุนะพัฒน์', 'นางสาว', 'ศิริวรรณ แพงแก้ว', 'มหาวิทยาลัยราชภัฏอุบลราชธานี', 'Oral', 'Good'),
(42, 166, 'เว็บไซต์ขายนาฬิกาออนไลน์', 'นางสาว', 'สุวิมล ฉัตรสุวรรณ', 'มหาวิทยาลัยราชภัฏอุบลราชธานี', 'Oral', 'Good'),
(43, 173, 'การประยุกต์ Agile และ DevOps  สำหรับการพัฒนาระบบบริหารจัดการการสอบ', 'นาย', 'ธนวินท์ ภูผาเงิน', 'มหาวิทยาลัยบูรพา วิทยาเขตชลบุรี', 'Oral', 'Very Good'),
(44, 176, 'ระบบคำนวณการเดินหมากฮอสโดยใช้การวิเคราะห์รูปภาพ', 'นาย', 'อรรถพล เล็ดลอด', 'มหาวิทยาลัยนเรศวร', 'Oral', 'Very Good'),
(45, 181, 'ระบบจัดการข้อมูลของร้านให้บริการอาหารโต๊ะจีน', 'นาย', 'พงศธร ผดุงทรง', 'มหาวิทยาลัยราชภัฎพระนครศรีอยุธยา', 'Poster', 'Very Good'),
(46, 182, 'ระบบฝ่ายวิศวกรรม TR/Di', 'นางสาว', 'สุชาดา ศรีชัย', 'มหาวิทยาลัยบูรพา วิทยาเขตชลบุรี', 'Oral', 'Good'),
(47, 184, 'การพัฒนาสื่อความจริงเสมือน เพื่อนำเสนอแหล่งท่องเที่ยวโบราณสถาน อำเภอเชียงแสน จังหวัดเชียงราย', 'นาย', 'ศุภกิจ จันทร์ตา', 'มหาวิทยาลัยราชภัฏเชียงราย', 'Poster', 'Very Good'),
(48, 185, 'ระบบเฝ้าระวังโดยการจดจำใบหน้า', 'นาย', 'ปฏิภาณ ก้อนคำ ', 'มหาวิทยาลัยนเรศวร', 'Oral', 'Very Good'),
(49, 189, 'ระบบการจัดการร้านขายปลาตากแห้ง', 'นางสาว', 'ปวีณา จับทอง', 'มหาวิทยาลัยราชภัฎพระนครศรีอยุธยา', 'Poster', 'Good'),
(50, 195, 'ระบบจัดการข้อมูลโรงพยาบาลสัตว์', 'นาย', 'อนุชา ศิริแพทย์', 'มหาวิทยาลัยราชภัฎพระนครศรีอยุธยา', 'Poster', 'Good'),
(51, 196, 'ระบบสารสนเทศศิษย์เก่า โรงเรียนบ้านสวน (จั่นอนุสรณ์) ALUMNI INFORMATION SYSTEM OF BANSUANJANANUSORN SCHOOL', 'นาย', 'ชัยสิทธิ์ เส็งสูนย์', 'มหาวิทยาลัยศรีปทุม วิทยาเขตชลบุรี', 'Oral', 'Good'),
(52, 197, 'การออกแบบและพัฒนาระบบเว็บไซต์ โรงเรียนวัฒนดรุณวิทย์  A DESIGN AND DEVELOPMEN OF WATTANADAROONWITSCHOOL’S WEBSITE', 'นาย', 'ภควัฒน์ งามวงศ์วาน', 'มหาวิทยาลัยศรีปทุม วิทยาเขตชลบุรี', 'Oral', 'Good'),
(53, 199, 'ระบบการจัดการข้อมูลและกำหนดสิทธิผู้มีอุปการคุณ โรงพยาบาลสมเด็จพระบรมราชเทวี ณ ศรีราชา บนเครือข่ายอินเทอร์เน็ต Online Management Of Sponsor Privilege Information System Queen Savang Vadhana Memorial Hospital', 'นาย', 'ภูวนนท์ ทรัพย์สิน,  นนทวัฒน์ ส้มดี', 'มหาวิทยาลัยศรีปทุม วิทยาเขตชลบุรี', 'Oral', 'Good'),
(54, 205, 'ระบบการจัดการจัดชุดสินค้าบนเครือข่ายอินเทอร์เน็ต บริษัท คลังศึกษา จำกัด PRODUCT MANAGEMENT SYSTEM ON INTERNET FOR EDUCATION  TREASURY CO., LTD.', 'นาย', 'ภัทรพงศ์ ชลเทพ', 'มหาวิทยาลัยศรีปทุม วิทยาเขตชลบุรี', 'Oral', 'Good'),
(55, 206, 'ระบบการจัดการข้อมูลฝึกอบรมพนักงาน  บริษัท โฟมเทค อินเตอร์เนชั่นแนล จำกัด', 'นางสาว', 'นลินนิภา บุญเจริญ', 'มหาวิทยาลัยศรีปทุม วิทยาเขตชลบุรี', 'Oral', 'Good'),
(56, 207, 'ระบบสารสนเทศการจัดเก็บหนังสือรับ – ส่ง เอกสารราชการ เทศบาลตำบลพลา', 'นางสาว', 'ปาริฉัตร มุขดา', 'มหาวิทยาลัยศรีปทุม วิทยาเขตชลบุรี', 'Oral', 'Good'),
(57, 208, 'ระบบสารสนเทศการจัดการข้อมูลคลังสินค้า ร้าน กราฟฟี่ จีดี Stock Information Management System from Graphy GD Shop', 'นาย', 'ธีรไนย  ควรคิด', 'มหาวิทยาลัยศรีปทุม วิทยาเขตชลบุรี', 'Oral', 'Good'),
(58, 210, 'Su Cactus shop application', 'นางสาว', 'สุบิณฑ์ญา ตื้อถา', 'มหาวิทยาลัยราชภัฎพระนครศรีอยุธยา', 'Oral', 'Good'),
(59, 217, 'เว็บแอปพลิเคชันการประมาณแคลอรี่อาหารและเครื่องดื่มจากภาพถ่าย', 'นางสาว', 'สุพัตรา พงษ์พานิช', 'มหาวิทยาลัยนเรศวร', 'Oral', 'Good'),
(60, 219, 'แอปพลิเคชันส่งเสริมการท่องเที่ยวจังหวัดชัยนาท', 'นางสาว', 'ประกายบุญ ม่วงทอง', 'มหาวิทยาลัยสวนดุสิต', 'Oral', 'Good'),
(61, 221, 'การจัดการพื้นที่จอดรถจักรยานยนต์แบบมีส่วนร่วมของประชาคม ด้วยแอปพลิเคชันบนระบบปฏิบัติการแอนดรอยซ์ A Management of Motorcycle Parking from Community Participation with Application Development on an Android Operating Systems', 'นาย', 'มงคลชัย แก้วภมร', 'มหาวิทยาลัยสวนดุสิต', 'Oral', 'Good'),
(62, 223, 'สื่อการเรียนรู้โครงการอาชีพพระราชทานตามแนวพระราชดำริ ในหลวงรัชกาลที่ 9 ด้วยเทคโนโลยีเสมือนจริงบนระบบปฏิบัติการแอนดรอยด์', 'นางสาว', 'โชติรส เดชจำเริญ', 'มหาวิทยาลัยสวนดุสิต', 'Oral', 'Very Good'),
(63, 224, 'การพัฒนาระบบสารสนเทศเพื่อการจัดการร้านซักรีด', 'นางสาว', 'พรทิพย์ ชนะพาล', 'มหาวิทยาลัยราชภัฏชัยภูมิ', 'Oral', 'Very Good'),
(64, 225, 'แอปพลิเคชันการจัดการข้อมูลการเลี้ยงกุ้งขาว กรณีศึกษาชุมชนบ้านแหลมทอง อำเภอปากพะยูน จังหวัดพัทลุง', 'นางสาว', 'ณัฐมาศ สันสาคร', 'มหาวิทยาลัยสวนดุสิต', 'Oral', 'Good'),
(65, 226, 'ระบบบริหารจัดการข้อมูลการให้บริการเช่ารถ', 'นาย', 'จีระวัฒน์ อิ่มสบาย', 'มหาวิทยาลัยราชภัฎพระนครศรีอยุธยา', 'Poster', 'Good'),
(66, 229, 'ระบบจัดการตลาดนัดราชภัฎพระนครศรีอยุธยา', 'นางสาว', 'ศศิกานต์ ทรายมะเริง', 'มหาวิทยาลัยราชภัฎพระนครศรีอยุธยา', 'Poster', 'Good'),
(67, 234, 'เว็บแอปพลิเคชันร้านขายไก่สดออนไลน์', 'นาย', 'ธันวา เม๊าะหะมะ', 'มหาวิทยาลัยราชภัฏจันทรเกษม', 'Oral', 'Good'),
(68, 235, 'ระบบฐานข้อมูลตัวแทนประกันชีวิต', 'นาย', 'ศิวะกรณ์  แคนเพชร', 'มหาวิทยาลัยราชภัฎพระนครศรีอยุธยา', 'Poster', 'Good'),
(69, 241, 'การพัฒนาแอปพลิเคชัน เบบี้ เฮลท์ สำหรับพ่อแม่มือใหม่บน ระบบปฏิบัติการแอนดรอยด์ Baby Health Application Development for New Parents on Android Operating System', 'นางสาว', 'กนกวรรณ  พันพิมพ์', 'มหาวิทยาลัยกาฬสินธุ์          ', 'Oral', 'Good'),
(70, 245, 'ระบบทำนายระดับความหวานของอ้อยผ่านอุปกรณ์มือถือ', 'นางสาว', 'เบญญาภา จันทันโอ', 'มหาวิทยาลัยนเรศวร', 'Oral', 'Very Good'),
(71, 246, 'การพัฒนาแอปพลิเคชันสั่งอาหารบุฟเฟ่ต์ บนระบบปฏิบัติการแอนดรอยด์ เพื่อสนับสนุนการตัดสินใจผู้บริหารร้านหมูกระทะชาละวัน', 'นาย', 'เจนภพ สิทธิโชติ', 'มหาวิทยาลัยราชภัฏพิบูลสงคราม', 'Oral', 'Good'),
(72, 247, 'ระบบจัดการการรับบริการร้านศิวกรคาร์แคร์', 'นางสาว', 'พัชรินทร์ ไตรรัตนาวิไล', 'มหาวิทยาลัยราชภัฏธนบุรี', 'Oral', 'Good'),
(73, 251, 'แอปพลิเคชันเสริมทักษะคำศัพท์ภาษาอังกฤษสำหรับเด็กอนุบาล (KID DEE) ', 'นางสาว', 'รัตนาภรณ์ อาจกมล', 'มหาวิทยาลัยราชภัฏชัยภูมิ', 'Oral', 'Very Good'),
(74, 255, 'ระบบคลังสิ่งอุปกรณ์เพื่อสนับสนุนการตัดสินใจสำหรับผู้บริหารของ กองบัญชาการช่วยรบที่ 2', 'ระบบคลังสิ่งอุปกรณ์', 'ผาสุข เผือดจันทึก', 'มหาวิทยาลัยเทคโนโลยีราชมงคลอีสาน วิทยาเขตนครราชสีมา', 'Poster', 'Very Good'),
(75, 257, 'ระบบสารสนเทศเพื่อการรายงานการจำหน่ายไฟฟ้าและพลังงานเชื้อเพลิง ภาคตะวันออกเฉียงเหนือด้วยระบบธุรกิจอัจฉริยะ กรณีศึกษาสำนักงานสถิติจังหวัดนครราชสีมา', 'นาย', 'อภิชา ชาติธราพงศ์', 'มหาวิทยาลัยราชภัฏนครราชสีมา', 'Oral', 'Very Good'),
(76, 259, 'เกมเสริมทักษะการคิดทางคณิตศาสตร์', 'นาย', 'สิปปกร นิ่มสวน', 'มหาวิทยาลัยเทคโนโลยีราชมงคลตะวันออก วิทยาเขตบางพระ', 'Oral', 'Very Good'),
(77, 260, 'ระบบขออนุญาตนำของเข้าและออก (Carry In-Out Permission System)', 'นางสาว', 'ปณิตา หมันหนุน', 'มหาวิทยาลัยบูรพา วิทยาเขตชลบุรี', 'Oral', 'Good'),
(78, 262, 'ระบบสวนสนุกวัฒนธรรม', 'นาย', 'เจษฎากร แซ่ล่อ', 'มหาวิทยาลัยบูรพา วิทยาเขตชลบุรี', 'Oral', 'Good'),
(79, 263, 'Preparation of Archaeological and Antiquities', 'นางสาว', 'ปมุตา แก้วจิตร', 'มหาวิทยาลัยบูรพา วิทยาเขตชลบุรี', 'Oral', 'Good'),
(80, 265, 'ระบบจัดการการประมูลมังคุด ออนไลน์ ', 'นาย', 'พงศกร เวียงดอนก่อ', 'มหาวิทยาลัยบูรพา วิทยาเขตจันทบุรี', 'Poster', 'Good'),
(81, 266, 'ระบบแนะนำเส้นทางแหล่งท่องเที่ยวชุมชนในจังหวัดอ่างทอง', 'นางสาว', 'กันยารัตน์  อารีย์วงศ์สกุล', 'มหาวิทยาลัยราชภัฏบ้านสมเด็จเจ้าพระยา ', 'Oral', 'Very Good'),
(82, 268, 'Snake Game LED', 'นาย', 'สุนันท์ สระขุนทด', 'มหาวิทยาลัยราชภัฏนครราชสีมา', 'Oral', 'Good'),
(83, 275, 'ระบบตรวจจับและลงบันทึกรถยนต์ภายในมหาวิทยาลัยนเรศวร', 'นาย', 'อานนท์ หลากสุขถม', 'มหาวิทยาลัยนเรศวร', 'Oral', 'Good'),
(84, 276, 'การพัฒนาแอปพลิเคชันมหาวิทยาลัยกาฬสินธุ์ KALASIN UNIVERSITY APPLICATION DEVELOPMENT', 'นางสาว', 'กัญญานัฐ แก้วสาร', 'มหาวิทยาลัยกาฬสินธุ์          ', 'Oral', 'Good'),
(85, 278, 'ระบบการคัดแยกเอกสารด้วยรหัสแท่งบาร์โค้ด', 'นาย', 'กฤติธี คำตา', 'มหาวิทยาลัยราชภัฏพิบูลสงคราม', 'Oral', 'Good'),
(86, 279, 'ระบบจองคิวรับการรักษาออนไลน์ผ่านเว็บแอปพลิเคชัน กรณีศึกษา โรงพยาบาลม่วงสามสิบ จังหวัดอุบลราชธานี', 'นางสาว,นางสาว', 'เบญจรัตน์ จำปาเงิน,พัชรา ทองงาม', 'มหาวิทยาลัยราชภัฏอุบลราชธานี', 'Oral', 'Very Good'),
(87, 280, 'ระบบเช็คชื่อนักเรียนโรงเรียนสวนหม่อนด้วย RFID', 'นาย', 'การออกแบบและพัฒนาระบบเช็คชื่อนักเรียนของโรงเรียนสวนหม่อนด้วยเทคโนโลยี RFID', 'มหาวิทยาลัยเทคโนโลยีราชมงคลอีสาน วิทยาเขตนครราชสีมา', 'Oral', 'Good'),
(88, 281, 'การวิเคราะห์กฎความสัมพันธ์การซื้อสินค้ากลุ่มวัสดุก่อสร้าง โดยใช้เทคนิคการทำเหมืองข้อมูล', 'นางสาว', 'อรอนงค์ จินดาภรณ์', 'มหาวิทยาลัยเทคโนโลยีราชมงคลรัตนโกสินทร์ วิทยาเขตวังไกลกังวล', 'Oral', 'Very Good'),
(89, 282, 'โมเดลพยากรณ์ความเสี่ยงในการเกิดอุบัติเหตุทางถนนในเขตอำเภอหัวหิน โดยใช้เทคนิคการทำเหมืองข้อมูล', 'นางสาว', 'อาฑิตญา ชูแก้ว', 'มหาวิทยาลัยเทคโนโลยีราชมงคลรัตนโกสินทร์ วิทยาเขตวังไกลกังวล', 'Oral', 'Very Good'),
(90, 285, 'Krapraolaewtae Delivery Application', 'นางสาว', 'ภาษิตา คงนวน', 'มหาวิทยาลัยขอนแก่น', 'Oral', 'Very Good'),
(91, 287, 'แบบจำลองทำนายโอกาสการกู้ยืมเงินกองทุนให้กู้ยืมเพื่อการศึกษา กรณีศึกษามหาวิทยาลัยเทคโนโลยีราชมงคลรัตนโกสินทร์ วิทยาเขตวังไกลกังวล ', 'นางสาว', 'ศยามล นาวารัตน์', 'มหาวิทยาลัยเทคโนโลยีราชมงคลรัตนโกสินทร์ วิทยาเขตวังไกลกังวล', 'Oral', 'Very Good'),
(92, 289, 'การพัฒนาโปรแกรมให้บริการช่องทางการเชื่อมต่อ (API) สำหรับข้อมูลเบอร์โทรฉุกเฉิน', 'นางสาว', 'สุพัตรา ศรีโพดก', 'มหาวิทยาลัยเทคโนโลยีราชมงคลสุวรรณภูมิ ศูนย์สุพรรณบุรี', 'Poster', 'Good'),
(93, 290, 'แอปพลิเคชันความจริงเสริม สวนสัตว์เปิดเขาเขียว จังหวัดชลบุรี', 'นางสาว', 'วีณา คงพิษ', 'มหาวิทยาลัยศรีปทุม วิทยาเขตชลบุรี', 'Oral', 'Good'),
(94, 292, 'แอปพลิเคชันฝึกเขียนพยัญชนะภาษาไทยด้วยเทคโนโลยีความจริงเสริม ', 'นางสาว', 'วีณา คงพิษ', 'มหาวิทยาลัยศรีปทุม วิทยาเขตชลบุรี', 'Oral', 'Good'),
(95, 293, 'แอปพลิเคชันป้ายจราจรผ่านเทคโนโลยีความจริงเสริม', 'นางสาว', 'วีณา คงพิษ', 'มหาวิทยาลัยศรีปทุม วิทยาเขตชลบุรี', 'Oral', 'Good'),
(96, 295, 'เทคโนโลยีความจริงเสริมจำลองสินค้าผลิตภัณฑ์สำหรับผู้หญิง', 'นางสาว', 'วีณา คงพิษ', 'มหาวิทยาลัยศรีปทุม วิทยาเขตชลบุรี', 'Oral', 'Good'),
(97, 296, 'A Development of Web-based Application for CPSU Senior Project', 'นางสาว', 'อชิรญา อนุตรวัฒนกุล', 'มหาวิทยาลัยศิลปากร', 'Oral', 'Good'),
(98, 297, 'แอปพลิเคชันการคำนวณน้ำหนักสัมภาระสำหรับขึ้นเครื่องบิน', 'นาย', 'นนธวัช สิงห์แก้ว', 'มหาวิทยาลัยสวนดุสิต', 'Oral', 'Good'),
(99, 298, 'การพัฒนาเทคโนโลยีความจริงเสริมเครื่องดนตรีสากล', 'นางสาว', 'วีณา คงพิษ', 'มหาวิทยาลัยศรีปทุม วิทยาเขตชลบุรี', 'Oral', 'Good'),
(100, 300, 'Construction company management system: case study of “chang nid construction”', 'นาย', 'วีรพงษ์ ศรีตระเวร', 'มหาวิทยาลัยราชภัฏธนบุรี', 'Oral', 'Very Good'),
(101, 301, 'การพัฒนารูปแบบเรียนการสอนกรณีศึกษาการประยุกต์ใช้เทคโนโลยีสารสนเทศเพื่อสนับสนุนการท่องเที่ยวชุมชน The Development of Instructional Model, Case Study of Application Information Technology to Support Community Based Tourism', 'นางสาว', 'สิริยา บุญยิ้ม', 'มหาวิทยาลัยราชภัฏพิบูลสงคราม', 'Poster', 'Good'),
(102, 302, 'สื่อประชาสัมพันธ์บนแผ่นพับเสมือน 3 มิติ ผ่านทางสมาร์ทโฟน  เพื่อส่งเสริมกิจการโรงแรมในเขตพื้นที่เมืองรอง  (กรณีศึกษา : โรงแรมริมปาว จังหวัดกาฬสินธุ์) Media on brochures Virtual 3D for facilitate  business hotel in less visited area  (Case study : Rimpao Ho', 'นาย', 'สิริวัฑฒ์ มูลทองลี', 'มหาวิทยาลัยกาฬสินธุ์          ', 'Oral', 'Very Good'),
(103, 304, 'ระบบซื้อขายงานศิลปะออนไลน์ (Vanto Art Gallery & Shop)', 'นาย', 'ธารตะวัน สันดุษิต', 'มหาวิทยาลัยราชภัฏเชียงราย', 'Oral', 'Good'),
(104, 305, 'ระบบจัดการร้านอาหาร', 'นางสาว', 'ศุภรัตน์ โสมณวัฒน์', 'มหาวิทยาลัยราชภัฏธนบุรี', 'Oral', 'Very Good'),
(105, 307, 'เกมสิงห์สาราสัตว์', 'นางสาว', 'นริศรา ชัยคง', 'มหาวิทยาลัยราชภัฏธนบุรี', 'Oral', 'Good'),
(106, 308, 'เทคโนโลยีความจริงเสริม วิธีการคุมกำเนิดด้วยถุงยางอนามัย', 'นางสาว', 'วีณา คงพิษ', 'มหาวิทยาลัยศรีปทุม วิทยาเขตชลบุรี', 'Oral', 'Good'),
(107, 310, 'ตัวแบบพยากรณ์ผลสัมฤทธิ์ทางการเรียน', 'นาย', 'นราธรณ์ โนจันทร์', 'มหาวิทยาลัยนเรศวร', 'Oral', 'Good'),
(108, 312, 'การประยุกต์ใช้ระบบสารสนเทศภูมิศาสตร์เพื่อประเมินราคาขายอสังหาริมทรัพย์ด้วยปัจจัยเชิงพื้นที่ กรณีศึกษาเขตพื้นที่จังหวัดระยอง', 'นางสาว', 'ธนพร สุวดิษฐ์', 'มหาวิทยาลัยราชภัฏรำไพพรรณี', 'Poster', 'Very Good'),
(109, 314, 'การเปรียบเทียบเทคนิคการสกัดข้อมูลอาคารด้วยข้อมูลภาพถ่ายจากยูเอวี', 'นางสาว', 'บัณฑิตา  ศิลาอาสน์', 'มหาวิทยาลัยราชภัฏรำไพพรรณี', 'Poster', 'Excellence'),
(110, 316, 'การพัฒนาโมบายแอปพลิเคชั่นเพื่อแสดงภาพสันนิษฐานในสภาพแวดล้อมเสมือนจริงโดยใช้เทคโนโลยี AR', 'นาย', 'สุรศักดิ์ อารินทร์ด้วง', 'มหาวิทยาลัยราชภัฏเชียงราย', 'Oral', 'Very Good'),
(111, 317, 'การประยุกต์ใช้ระบบภูมิสารสรเทศ เพื่อศึกษาความเหมาะสมเชิงพื้นที่สำหรับการปลูกข้าวนาปีและนาปรัง ', 'นางสาว', 'ตะวัน แสนจันทร์', 'มหาวิทยาลัยราชภัฏรำไพพรรณี', 'Poster', 'Very Good'),
(112, 320, 'Volunteer management Application', 'นาย', 'วรพล กฤตเวทิน', 'มหาวิทยาลัยขอนแก่น', 'Oral', 'Very Good'),
(113, 321, 'Planning Schedule for Khon Kaen University', 'นางสาว', 'ศศิมา จันดีเวียง', 'มหาวิทยาลัยขอนแก่น', 'Oral', 'Good'),
(114, 324, 'Online Reserving Van Ticket System Development : Case Study Chakkarat Tour', 'นางสาว', 'บรรณฑรวรรณ น้อยนอนเมือง', 'มหาวิทยาลัยเทคโนโลยีราชมงคลอีสาน วิทยาเขตนครราชสีมา', 'Poster', 'Good'),
(115, 326, 'การพัฒนาระบบแจ้งเตือนอุณหภูมิ และความชื้นห้องควบคุมเครือข่าย  ห้างสรรพสินค้าเซ็นทรัล นครราชสีมา ด้วยแอปพลิเคชันไลน์', 'นางสาว', 'ศุภานัน ทนงแผลง', 'มหาวิทยาลัยเทคโนโลยีราชมงคลอีสาน วิทยาเขตนครราชสีมา', 'Oral', 'Good'),
(116, 329, 'Wagyu Beef Tracking System, Surin Province', 'ระบบติดตามเนื้อวัววากิว', 'ระบบติดตามย้อนกลับเนื้อวัววากิว จังหวัดสุรินทร์', 'มหาวิทยาลัยเทคโนโลยีราชมงคลอีสาน วิทยาเขตนครราชสีมา', 'Poster', 'Good'),
(117, 331, 'แอปพลิเคชันให้ความรู้เกี่ยวกับยาสามัญประจำบ้าน', 'นางสาว', 'แพรพลอย ทุนผล', 'มหาวิทยาลัยราชภัฏจันทรเกษม', 'Oral', 'Good'),
(118, 333, 'การพัฒนาระบบบริหารจัดการฝึกประสบการณ์วิชาชีพ', 'นาย', 'ก้องพนา พิทักษ์กำพล', 'มหาวิทยาลัยราชภัฏเชียงราย', 'Oral', 'Good'),
(119, 336, 'แอปพลิเคชันเส้นทางนำเที่ยวพื้นที่เทศบาล ต.จันจว้า', 'นาย', 'ทศพร นุชบ้านป่า', 'มหาวิทยาลัยราชภัฏเชียงราย', 'Oral', 'Good'),
(120, 338, 'วีลแชร์ท่องเที่ยวทั่วเชียงราย', 'นาย', 'เมธินี อินกัน', 'มหาวิทยาลัยราชภัฏเชียงราย', 'Oral', 'Very Good'),
(121, 340, 'แชทบอทสอบถามข้อมูลบริการรถไฟฟ้าภายในมหาวิทยาลัยนเรศวร ', 'นางสาว', 'ดวงเดือน อัศวสุธีรกุล', 'มหาวิทยาลัยนเรศวร', 'Oral', 'Excellence'),
(122, 341, 'การจำแนกประเภทโรคเชื้อราของใบยางพาราด้วยการวิเคราะห์จากภาพถ่าย A classification of fungal in rubber leaves by image analysis', 'นางสาว', 'จิรพสิริ แก้วประชา', 'มหาวิทยาลัยศิลปากร', 'Oral', 'Very Good'),
(123, 343, 'Waterfall Model for Warehouse Management System Operating Instruction Module', 'นาย', 'ธนานันต์ เติมสิริสุขสิน', 'มหาวิทยาลัยบูรพา วิทยาเขตชลบุรี', 'Oral', 'Good'),
(124, 345, 'Development of Paint Sequence System with web application', 'นาย', 'ณัฐชนน โพธิ์งาม', 'มหาวิทยาลัยบูรพา วิทยาเขตชลบุรี', 'Oral', 'Good'),
(125, 346, 'BIB Number Detection & Recognition by Image Analysis', 'นางสาว', 'อรณิชา  เพ็ชรรัตน์', 'มหาวิทยาลัยศิลปากร', 'Oral', 'Good'),
(126, 350, 'Development of the Northern Science Park Uttaradit Rajabhat University Website', 'นาย', 'อภิสิทธิ์ เนาวรัตน์', 'มหาวิทยาลัยราชภัฏอุตรดิตถ์', 'Poster', 'Good'),
(127, 351, 'การพัฒนาต้นแบบการประยุกต์ใช้ระบบสะสมแต้มดิจิตอลไลน์ เพื่อสนับสนุนการท่องเที่ยวโดยชุมชน: กรณีศึกษาชุมชนวังทอง อำเภอวังทอง จังหวัดพิษณุโลก', 'นางสาว', 'กัญญาภัทร มาดกาด', 'มหาวิทยาลัยราชภัฏพิบูลสงคราม', 'Poster', 'Good'),
(128, 353, 'การพัฒนาสติ๊กเกอร์ไลน์ภาษามือ Development of sign language stickers', 'นาย ', 'พงศธร พละ', 'มหาวิทยาลัยกาฬสินธุ์          ', 'Oral', 'Good'),
(129, 354, 'ระบบตรวจจับและแจ้งเตือนการเกิดอุบัติเหตุภายในห้องน้ำสำหรับผู้สูงอายุด้วยการประมวลผลภาพ', 'นาย', 'ดวงเดือน อัศวสุธีรกุล', 'มหาวิทยาลัยนเรศวร', 'Oral', 'Very Good'),
(130, 356, 'Motion Graphic Knowledge about Pregnancy', 'นาย', 'ฐิติโชค เอกลักษณ์โพธิ์', 'มหาวิทยาลัยเทคโนโลยีพระจอมเกล้าพระนครเหนือ วิทยาเขตปราจีนบุรี', 'Oral', 'Good'),
(131, 360, 'การพัฒนาสื่อการเรียนรู้เรื่องวัฒนธรรมไทยด้วยเทคโนโลยีความเป็นจริงเสริม ', 'นาย', 'กรธวัช อัศวภูมิ', 'มหาวิทยาลัยสวนดุสิต', 'Oral', 'Very Good'),
(132, 361, 'Classify products of SIFT features with Machine learning', 'นาย', 'พงศกร แซ่ตั้ง', 'มหาวิทยาลัยขอนแก่น', 'Oral', 'Good'),
(133, 364, 'การพัฒนาแอปพลิเคชันสำหรับบอกพิกัดผู้รับจดหมายหรือพัสดุ', 'นางสาว', 'ชุติกาญจน์ สุขสุดประเสริฐ', 'มหาวิทยาลัยศิลปากร', 'Oral', 'Very Good'),
(134, 368, 'The Development of Graduate Ceremony Request Degree-Receiving Form System', 'นาย', 'ณัฐวุฒิ สุโทสา', 'มหาวิทยาลัยเทคโนโลยีราชมงคลอีสาน วิทยาเขตนครราชสีมา', 'Oral', 'Very Good'),
(135, 370, 'การหาความสัมพันธ์ผลการเรียน  กรณีศึกษา มก.ฉกส ', 'นางสาว', 'อัญชลีพร พุฒลา', 'มหาวิทยาลัยเกษตรศาสตร์ วิทยาเขตเฉลิมพระเกียรติ จังหวัดสกลนคร', 'Oral', 'Good'),
(136, 374, 'ระบบจัดการสหกรณ์เครดิตยูเนี่ยน', 'นาย', 'ศิริศักดิ์ มิคาระเศรษฐ์', 'มหาวิทยาลัยขอนแก่น', 'Oral', 'Good'),
(137, 376, 'โมบายแอปพลิเคชันชุดดินเพื่อสนับสนุนเกษตรกร  กรณีศึกษาจังหวัดเพชรบูรณ์', 'นางสาว', 'ธัญรัตน์  ปาศรี', 'มหาวิทยาลัยราชภัฏเพชรบูรณ์', 'Poster', 'Good'),
(138, 378, 'การพัฒนาแอปพลิเคชันบนระบบปฏิบัติการแอนดรอยด์ การจัดการข้อมลูรถขนส่งโลจิสติกส์สำหรับบริษัทขนส่ง', 'นางสาว', 'พฤกษา ศรีคงทน', 'มหาวิทยาลัยสวนดุสิต', 'Oral', 'Very Good'),
(139, 380, 'Student Activity Recording System', 'นาย', 'ชนันพร ขันแก้ว', 'มหาวิทยาลัยราชภัฏอุบลราชธานี', 'Oral', 'Very Good'),
(140, 381, 'Automatic Guppy Fish Feeder Model', 'นาย', 'วีรภัทร แก้วเจริญ', 'มหาวิทยาลัยเทคโนโลยีราชมงคลสุวรรณภูมิ ศูนย์สุพรรณบุรี', 'Oral', 'Good'),
(141, 383, 'หุ่นยนต์ตัดหญ้าอัจฉริยะ ', 'นาย', 'อภิสิทธิ หมั่นคำ', 'มหาวิทยาลัยราชภัฏนครราชสีมา', 'Oral', 'Good'),
(142, 386, 'แอปพลิเคชันท่องเที่ยวผู้สูงอายุ AR', 'นาย', 'เกียรติยศ คำหาญพล', 'มหาวิทยาลัยราชภัฏนครราชสีมา', 'Oral', 'Good'),
(143, 388, 'ระบบการจัดการ การเปลี่ยนยางของรถสิบล้อ  Management System Changing the tires of a ten-wheel car', 'นางสาว', 'ณิชกุล  กรวยสวัสดิ์', 'มหาวิทยาลัยเกษตรศาสตร์ วิทยาเขตศรีราชา', 'Oral', 'Excellence'),
(144, 390, 'Automatic Trash', 'นาย', 'ชินาธิป ประถมทอง', 'มหาวิทยาลัยเทคโนโลยีราชมงคลสุวรรณภูมิ ศูนย์สุพรรณบุรี', 'Oral', 'Good'),
(145, 391, 'เกมเก็บผลไม้หรรษา', 'นางสาว', 'ภาวิณี ปัททุม', 'มหาวิทยาลัยราชภัฏธนบุรี', 'Oral', 'Good'),
(146, 392, 'ระบบแนะนำการท่องเที่ยวของจังหวัดสระแก้ว', 'นาย', 'พุทธิพงษ์ พิพรรธพงษ์', 'มหาวิทยาลัยบูรพา วิทยาเขตสระแก้ว', 'Poster', 'Good'),
(147, 394, 'การพัฒนาแอปพลิเคชันสำหรับควบคุมการเปิด-ปิดประตูและหลอดไฟ', 'นาย', 'สรุิยา สายอุ้ย', 'มหาวิทยาลัยราชภัฏอุบลราชธานี', 'Oral', 'Very Good'),
(148, 396, 'การพัฒนาแอปพลิเคชั่นเพื่อสืบค้นข้อมูลการท่องเที่ยวและผลิตภัณฑ์ชุมชนด้วยการอ้างอิงพิกัดและพื้นที่ใกล้เคียงแบบพลวัต Mobile Application for Travel Information and Local Product Based On Location Base System and Related Neighborhoods', 'นางสาว', 'วรรณภา ทัพโยธา', 'มหาวิทยาลัยกาฬสินธุ์          ', 'Poster', 'Very Good'),
(149, 398, 'การพัฒนาระบบสารสนเทศด้านทรัพยากรมนุษย์โดยใช้ สถาปัตยกรรมแบบไฮบริดเอ็มวีซี', 'นาย', 'ธานินทร์ ประกอบสมบัติ', 'มหาวิทยาลัยบูรพา วิทยาเขตสระแก้ว', 'Poster', 'Good'),
(150, 400, 'การพัฒนาระบบสินค้าติดลัง กรณีศึกษาบริษัท ABC จำกัด (มหาชน) Development of Crate Products return system, case study of ABC Pub Co., Ltd.', 'นาย', 'ณภัสร์ พรหมโสฬส', 'มหาวิทยาลัยบูรพา วิทยาเขตสระแก้ว', 'Poster', 'Very Good'),
(151, 401, 'Management Information System of Ban Ba Lee Resort', 'นางสาว', 'ชีวาพร ภู่งาม', 'มหาวิทยาลัยราชภัฎพระนครศรีอยุธยา', 'Oral', 'Good'),
(152, 403, 'การพัฒนาเว็บแอปพลิเคชัน ผักเคาะบ้าน', 'นาย', 'เฉลิมพร สุนันทวิทย์', 'มหาวิทยาลัยราชภัฏเพชรบูรณ์', 'Poster', 'Very Good'),
(153, 407, 'ระบบสารสนเทศการบริหารจัดการห้องเช่า', 'นาย ', 'กุลวัฑฒ์ ภิรมย์ราช', 'มหาวิทยาลัยราชภัฏเพชรบูรณ์', 'Oral', 'Very Good'),
(154, 408, 'ระบบบริหารจัดการข้อมูลฟาร์มเลี้ยงไก่ กรณีศึกษาชุมชนโก่งธนู อำเภอเมือง จังหวัดลพบุรี', 'นางสาว', 'สุวิมล โพระนก ', 'มหาวิทยาลัยสวนดุสิต', 'Oral', 'Good'),
(155, 409, 'การพัฒนาไลน์บอทสำหรับตรวจสอบและแจ้งเตือนการเข้ากิจกรรม  กรณีศึกษา คณะวิทยาศาสตร์และเทคโนโลยี  มหาวิทยาลัยราชภัฏพิบูลสงคราม', 'นาย', 'จิตรภณ อิวชาวนา', 'มหาวิทยาลัยราชภัฏพิบูลสงคราม', 'Oral', 'Good'),
(156, 415, 'Medical Material Management System, Nakhonratchasima Rajanagarindra Psychiatric Hospital ', 'นาย', 'ณัฐนันท์ ราชจินดา', 'มหาวิทยาลัยเทคโนโลยีราชมงคลอีสาน วิทยาเขตนครราชสีมา', 'Oral', 'Good'),
(157, 422, 'THE DEVELOPMENT OF LEARNING MATERIALS 2D LIGHT AND VISION FOR STUDENTS GRADE 4', 'นาย', 'คุณานนต์ ศรีดาวงค์', 'มหาวิทยาลัยราชภัฏจันทรเกษม', 'Oral', 'Good'),
(158, 423, 'ระบบวิเคราะห์ทุนการศึกษา โดยใช้เทคนิคเหมืองข้อมูล', 'นาย', 'ภิรายุ  ตาดเกิด', 'มหาวิทยาลัยนเรศวร', 'Oral', 'Good'),
(159, 424, 'ระบบติดตามการใช้จ่ายงบประมาณสถานศึกษา ในสังกัดเทศบาลนครขอนแก่น Project Budget Tracking, Khon kaen Municipality', 'นางสาว', 'สุภาวดี สุวรรณศรี', 'มหาวิทยาลัยขอนแก่น', 'Oral', 'Good'),
(160, 427, 'การศึกษาการควบคุมยานไร้คนขับผ่านโพรโทคอลแมฟลิงก์', 'นาย', 'ธนวัฒน์ ปรีชาโชติ', 'มหาวิทยาลัยราชภัฏรำไพพรรณี', 'Oral', 'Very Good'),
(161, 428, 'การวิเคราะห์และสกัดคุณลักษณะของการเกิดเหตุการณ์สำคัญที่เกี่ยวข้องกับมหาวิทยาลัยไทยบนทวิตเตอร์', 'นาย', 'ธนาธร ทะนานทอง', 'มหาวิทยาลัยธรรมศาสตร์', 'Oral', 'Excellence'),
(162, 429, 'ระบบบริหารจัดการโครงการนักศึกษา', 'นาย', 'สมพงษ์ อายี่กู่', 'มหาวิทยาลัยราชภัฏเชียงราย', 'Oral', 'Very Good'),
(163, 430, 'ระบบลงทะเบียนเรียนศูนย์พัฒนาเด็กเล็กตำบลไทยสามัคคี', 'ว่าที่ ร.ต. ดร.', 'ศิริชัย กิ่งสีดา', 'มหาวิทยาลัยเทคโนโลยีราชมงคลอีสาน วิทยาเขตนครราชสีมา', 'Oral', 'Very Good'),
(164, 431, 'ระบบการเรียนแบบเต็มรูปแบบในอนาคต', 'นางสาว', 'นวรัตน์  สีเสน', 'มหาวิทยาลัยขอนแก่น', 'Oral', 'Very Good'),
(165, 432, 'การพัฒนาระบบถ่ายโอนข้อมูลภาพสัตว์ป่าระยะไกล', 'นาย', 'พงศ์ระพี นุชพงษ์', 'มหาวิทยาลัยราชภัฏรำไพพรรณี', 'Oral', 'Good'),
(166, 433, 'การวิเคราะห์ความเห็นของผู้โดยสารการบินไทยโดยใช้เหมืองข้อความ', 'นาย', 'อนุวัฒน์ พีระพันธ์', 'มหาวิทยาลัยนเรศวร', 'Oral', 'Very Good'),
(167, 435, 'ระบบจัดการเอกสารอิเล็กทรอนิกส์โครงการก่อสร้าง', 'นาย', 'อภิวัฒน์ มีศิลชัย', 'มหาวิทยาลัยราชภัฏเพชรบูรณ์', 'Oral', 'Good'),
(168, 436, 'Dog and Cat Dating Application', 'นางสาว', 'วศินี จันทรโสภณ', 'มหาวิทยาลัยขอนแก่น', 'Oral', 'Good'),
(169, 437, 'แอปพลิเคชันมือถือสำหรับการอ่านและตรวจสอบหมายเลขบนสลากกินแบ่งรัฐบาล สำหรับคนตาบอดบนระบบปฏิบัติการแอนดรอยด์', 'นางสาว', 'ณัฐญากร มีอัฐมั่น', 'มหาวิทยาลัยนเรศวร', 'Oral', 'Very Good'),
(170, 442, 'Vehicle Counting on the Road by Using CCTV', 'นาย', 'นนทวัฒน์ สุชาตวุฒิ', 'มหาวิทยาลัยศิลปากร', 'Oral', 'Good'),
(171, 443, 'ระบบแจ้งเตือนการเป็นสัดในโค', 'นางสาว', 'สุปรีญา  เลิศปาน', 'มหาวิทยาลัยศิลปากร', 'Oral', 'Very Good'),
(172, 447, 'Android Application for Guidance Attractive Places Case Study Sankhaburi District, Chai Nat Province', 'นาย', 'นิติพัฒน์ มานะสัมพันธุ์สกุล', 'มหาวิทยาลัยราชภัฏจันทรเกษม', 'Oral', 'Good'),
(173, 448, 'Online Ticket and Tour Package Distribution Assistance System', 'นางสาว', 'เกศกมล พรนิคม', 'มหาวิทยาลัยเทคโนโลยีราชมงคลรัตนโกสินทร์ วิทยาเขตบพิตรพิมุข จักรวรรดิ', 'Oral', 'Good'),
(174, 449, 'แอปพลิเคชันการเรียนรู้คำศัพท์ภาษาอังกฤษสำหรับเด็ก', 'นางสาว', 'จิราณี ฉวีรัตน์', 'มหาวิทยาลัยศิลปากร', 'Oral', 'Very Good'),
(175, 451, 'Jigsaw Puzzle Game for Kids on Android Operating System', 'เกมต่อภาพ', 'กิตติพงศ์ ฆ้องชัย', 'มหาวิทยาลัยราชภัฏอุตรดิตถ์', 'Poster', 'Very Good'),
(176, 453, 'Application Development for Drug Reminder on Android Operating System', 'นาย', 'วิษรุต เม่นหวา', 'มหาวิทยาลัยสวนดุสิต', 'Oral', 'Very Good'),
(177, 456, 'English2Thai Movie Translate from English screenplay ', 'นางสาว', 'สิริรัตน์ ธีรพันธุ์เสถียร', 'มหาวิทยาลัยศิลปากร', 'Oral', 'Very Good'),
(178, 457, 'ระบบจัดการภาระงานสายวิชาการ', 'นาย', 'พิพิชฌ์ ศรีคำภา', 'มหาวิทยาลัยราชภัฎพระนครศรีอยุธยา', 'Oral', 'Very Good'),
(179, 461, 'ระบบควบคุมอุปกรณ์ไฟฟ้าอัตโนมัติโดยการตรวจจับตัวบุคคล', 'นางสาว', 'น้ำทิพย์  พารักษ์', 'มหาวิทยาลัยราชภัฏอุบลราชธานี', 'Oral', 'Very Good'),
(180, 463, 'Hotel management and dormitory apartment management system AVP RENT', 'นาย', 'จิรภัทร ลาภอุดมศักดา', 'มหาวิทยาลัยบูรพา วิทยาเขตชลบุรี', 'Oral', 'Good'),
(181, 466, 'Computer Based Exams Online', 'นาย', 'เศรษฐบุตร หลวงสนาม', 'มหาวิทยาลัยบูรพา วิทยาเขตชลบุรี', 'Oral', 'Very Good'),
(182, 467, 'ระบบยืนยันตัวตนด้วยใบหน้าเพื่อเข้าใช้ห้องปฏิบัติการคอมพิวเตอร์', 'นาย', 'พงศ์ศิริ บัวสาร', 'มหาวิทยาลัยราชภัฏอุบลราชธานี', 'Oral', 'Good'),
(183, 468, 'แอปพลิเคชันจัดการสีนานวล', 'นาย', 'ภาณุพงศ์ ทองศรี', 'มหาวิทยาลัยขอนแก่น', 'Oral', 'Good'),
(184, 470, 'ระบบตรวจจับที่ว่างในลานจอดรถ', 'นางสาว', 'ธนภรณ์  แดงสังวาลย์', 'มหาวิทยาลัยราชภัฎพระนครศรีอยุธยา', 'Oral', 'Good'),
(185, 471, 'ต้นแบบการจำแนกขยะอัตโนมัติเชิงรูปภาพบนระบบสมองกลฝังตัว Automatic Image-based Classification for Separating Garbage via Embedded System', 'นาย', 'ไกรวิท มงคลสกุลฤทธิ์', 'มหาวิทยาลัยเกษตรศาสตร์ วิทยาเขตเฉลิมพระเกียรติ จังหวัดสกลนคร', 'Oral', 'Very Good'),
(186, 472, 'แอปพลิเคชั่นการปฐมพยาบาลที่ถูกวิธีบนระบบปฏิบัติการแอนดรอยด์', 'นางสาว', 'วรกานต์ จันทร์ไทย', 'มหาวิทยาลัยราชภัฏชัยภูมิ', 'Oral', 'Very Good'),
(187, 476, 'ระบบสารสนเทศร้านจัดการงานแต่ง', 'นางสาว', 'อามีนะ  นาคประวิต', 'มหาวิทยาลัยราชภัฎพระนครศรีอยุธยา', 'Oral', 'Good'),
(188, 477, 'ระบบพาณิชย์อิเล็กทรอนิกส์เครื่องปั้นดินเผาบ้านมอญ', 'นางสาว', 'สุวนันท์ แร่เงิน, ปิยพร สุระคันธ์, และอธิกัญญ์ แพรต่วน', 'มหาวิทยาลัยราชภัฏนครสวรรค์', 'Poster', 'Good'),
(189, 478, 'เว็บแอพลิเคชั่นสำหรับร้านทำป้าย', 'นางสาว', 'กานต์ชนก ควรเขียว', 'มหาวิทยาลัยเทคโนโลยีพระจอมเกล้าพระนครเหนือ วิทยาเขตปราจีนบุรี', 'Oral', 'Good'),
(190, 479, 'KKU Guide Application', 'นาย', 'ณัฐพงษ์ เลิศวรสิริกุล', 'มหาวิทยาลัยขอนแก่น', 'Oral', 'Good'),
(191, 482, 'เว็บแอพพลิเคชั่นรองรับทุกอุปกรณ์สำหรับตรวจอาการตาบอดสีเบื้องต้น พร้อมวิเคราะห์พฤติกรรมการมองระหว่างทำการ (Responsive Web Application for primary color blindness test and the eye gaze behavior analysis)', 'นาย', 'ธนดล ซุยนันท์', 'มหาวิทยาลัยศิลปากร', 'Oral', 'Very Good'),
(192, 484, 'การพัฒนาอุปกรณ์และโปรแกรมเพื่อวัดประสิทธิภาพการวิ่ง', 'นาย', 'ธีรพล นาน้อย', 'สถาบันเทคโนโลยีพระจอมเกล้าเจ้าคุณทหารลาดกระบัง', 'Poster', 'Excellence'),
(193, 485, 'Roof Heating Model with Automatic System', 'นาย', 'ปริญญา  แสงไวย์', 'มหาวิทยาลัยเทคโนโลยีราชมงคลสุวรรณภูมิ ศูนย์สุพรรณบุรี', 'Oral', 'Good'),
(194, 487, 'ระบบจัดเก็บค่าน้ำประปาด้วยคิวอาร์โค้ด  กรณีศึกษา ประปาหมู่บ้านหนองเต่า', 'นางสาว', 'พรไพลิน ธีระแนว', 'มหาวิทยาลัยราชภัฏนครสวรรค์', 'Poster', 'Good'),
(195, 488, 'THE DEVELOPMENT OF MULTIMEDIA 2D ABOUT BENEFITS OF VITAMINS AND VITAMIN DEFICIENCY SYMPTOMS', 'นาย', 'คุณานนต์ ศรีดาวงค์', 'มหาวิทยาลัยราชภัฏจันทรเกษม', 'Oral', 'Good'),
(196, 491, 'Recommended System for Travel Place in Thailand by Ontology', 'นาย', 'พีระพงษ์ สุวรรณเทพ', 'มหาวิทยาลัยเทคโนโลยีราชมงคลตะวันออก วิทยาเขตจักรพงษภูวนารถ', 'Oral', 'Good'),
(197, 492, 'Walking Job', 'นาย', 'วีรเดช เฝดสูงเนิน', 'มหาวิทยาลัยรามคำแหง', 'Oral', 'Very Good'),
(198, 493, 'Web application to Promote Thai Desserts at Ban Rong Wua  Lat Bua Luang District System', 'นางสาว', 'กรรณิกา ไทยประยูร', 'มหาวิทยาลัยราชภัฎพระนครศรีอยุธยา', 'Oral', 'Very Good'),
(199, 494, 'Web Application for Tourism in Bang Pa-in District System', 'นางสาว', 'วาสินี สิงหนาท', 'มหาวิทยาลัยราชภัฎพระนครศรีอยุธยา', 'Oral', 'Good'),
(200, 496, 'เว็บแอพพลิเคชั่นการจัดการร้านตุ๊กตา', 'นางสาว', 'เมธา ปิ่นคล้าย', 'มหาวิทยาลัยเทคโนโลยีพระจอมเกล้าพระนครเหนือ วิทยาเขตปราจีนบุรี', 'Oral', 'Good'),
(201, 497, 'แอปพลิเคชันตู้จดหมายอพาร์ทเมนท์', 'นาย', 'นาเคนทร์ จุสกรณ์', 'มหาวิทยาลัยเทคโนโลยีราชมงคลตะวันออก วิทยาเขตจักรพงษภูวนารถ', 'Oral', 'Very Good'),
(202, 502, 'การพัฒนาแอปพลิเคชันระบบรดน้ำอัจฉริยะโดยการวัดความชื้นในดิน กรณีศึกษา ต้นชวนชมก่อนส่งเข้าประกวด', 'นาย', 'อานนท์ ขำมณี', 'มหาวิทยาลัยสวนดุสิต', 'Poster', 'Good'),
(203, 503, 'Test Driven Development for Financial Management System', 'นาย', 'เรืองวิทย์ นักบุญ', 'มหาวิทยาลัยบูรพา วิทยาเขตชลบุรี', 'Poster', 'Very Good'),
(204, 505, 'Automatic Fabric Collection Model', 'นาย', 'พีรภัทร สว่างศรี', 'มหาวิทยาลัยเทคโนโลยีราชมงคลสุวรรณภูมิ ศูนย์สุพรรณบุรี', 'Oral', 'Very Good'),
(205, 506, 'การรู้จำเสียงพูดภาษาไทยและภาษาอังกฤษ ด้วยโครงข่ายประสาทเทียมแบบคอนโวลูชัน', 'นาย', 'ไพรัตน์ อติชาต', 'มหาวิทยาลัยศิลปากร', 'Oral', 'Very Good'),
(206, 514, 'ระบบติดตามกระบวนงาน แผนกมิเตอร์และหม้อแปลง', 'นาย', 'สุทธินันท์ วงศ์สุทธิรัตน์', 'มหาวิทยาลัยเทคโนโลยีราชมงคลอีสาน วิทยาเขตนครราชสีมา', 'Poster', 'Good'),
(207, 515, 'Application screening depression patients in adolescents introductory', 'นาย', 'พุฒิพงษ์ สินภู่', 'มหาวิทยาลัยศิลปากร', 'Oral', 'Very Good'),
(208, 517, 'เว็บไซต์สนามแบดมินตัน ', 'นาย', 'หัสดิน อินตาราม', 'มหาวิทยาลัยราชภัฏเชียงราย', 'Oral', 'Good'),
(209, 520, 'การฝึกแต่งประโยคและสุภาษิตสำนวนไทยในรูปแบบเกม ', 'นางสาว', 'เบญจพร แย้มดี', 'มหาวิทยาลัยศิลปากร', 'Oral', 'Very Good'),
(210, 525, 'ปัจจัยสมรรถนะที่มีอิทธิพลต่อความสำเร็จในงานผ่านการจัดการข้อมูลของบุคลากรในสายงานเลขานุการทางการแพทย์ของโรงพยาบาลเอกขนาดกลางในกรุงเทพมหานคร', 'นางสาว', 'ปวีณา สปิลเลอร์', 'มหาวิทยาลัยสวนดุสิต', 'Oral', 'Good'),
(211, 526, 'การออกแบบและพัฒนาระบบจัดการบ้านอัจฉริยะสำหรับผู้สูงอายุด้วยเทคโนโลยีอินเทอร์เน็ตในทุกสิ่ง (Design and development of smart home management systems for the elderly with internet of everything technology)', 'อาจารย์', 'ประหยัด เลวัน', 'มหาวิทยาลัยรามคำแหง', 'Poster', 'Good'),
(212, 527, 'แอปพลิเคชันติดตามรถไบโอดีเซล มหาวิทยาลัยเกษตรศาสตร์ วิทยาเขตกำแพงแสน', 'นางสาว', 'นันทนัช ศรีมงคล', 'มหาวิทยาลัยเกษตรศาสตร์ วิทยาเขตกำแพงแสน', 'Oral', 'Very Good'),
(213, 528, 'ระบบชั้นหนังสือแนะนำ (Recommendation Bookshelf)', 'นาย', 'วิธวินท์ กุลธรรมโยธิน', 'มหาวิทยาลัยศิลปากร', 'Oral', 'Very Good'),
(214, 533, 'Web Application for Food Contamination Inspection Management ', 'นางสาว', 'ภัสสภร   มูลดี', 'มหาวิทยาลัยเทคโนโลยีพระจอมเกล้าพระนครเหนือ วิทยาเขตปราจีนบุรี', 'Oral', 'Good'),
(215, 534, 'การพยากรณ์โอกาสการเข้าศึกษาต่อของนักศึกษาใหม่  โดยใช้เทคนิคการทำเหมืองข้อมูล คณะบริหารธุรกิจ  มหาวิทยาลัยเทคโนโลยีราชมงคลรัตนโกสินทร์ วิทยาเขตวังไกลกังวล', 'นางสาว', 'แสงระวี เหล็กดี', 'มหาวิทยาลัยเทคโนโลยีราชมงคลรัตนโกสินทร์ วิทยาเขตวังไกลกังวล', 'Oral', 'Good'),
(216, 538, 'การพัฒนาเว็บไซต์สหกรณ์ออมทรัพย์ตำรวจตระเวนชายแดนที่42จำกัด', 'นางสาว', 'นุชนาฎ เสนสม', 'มหาวิทยาลัยเทคโนโลยีราชมงคลศรีวิชัย วิทยาเขตนครศรีธรรมราช', 'Poster', 'Good'),
(217, 541, 'การเพิ่มประสิทธิภาพการตรวจจับป้ายสำหรับผู้พิการทางสายตาโดยใช้เทคนิคการขยายภาพร่วมกับการตัดภาพด้วย Mask-RCNN', 'นาย', 'ไพสิฐ วัฒนภัทราภรณ์', 'มหาวิทยาลัยศิลปากร', 'Oral', 'Very Good'),
(218, 550, 'การวิเคราะห์ข้อความจากโซเชียลมีเดีย ที่มีต่อศิลปินด้วยเทคนิคการเรียนรู้เชิงลึก กรณีตัวอย่าง BNK48 Social Media Sentences Analysis Using Deep Learning : Case Study BNK48', 'นาย', 'เขมทัต ศิริขวัญพงศ์', 'มหาวิทยาลัยศิลปากร', 'Oral', 'Very Good'),
(219, 555, 'การเชื่อมต่อระบบการยืนยันตัวตนด้วยใบหน้าเพื่อควบคุมการเข้าถึง', 'นาย', 'วรางคณา กิ้มปาน', 'สถาบันเทคโนโลยีพระจอมเกล้าเจ้าคุณทหารลาดกระบัง', 'Poster', 'Excellence'),
(220, 556, 'ระบบคัดเลือกภาพสวยของสินค้า แบรนด์ BoxJourney  โดยใช้เทคนิคการเรียนรู้เชิงลึก', 'นางสาว', 'ธัญชนก มะหังสา', 'มหาวิทยาลัยศิลปากร', 'Oral', 'Very Good'),
(221, 557, 'การตรวจติดตามและแจ้งเตือนแนวโน้มของข้อความจากโซเชียล ผ่านช่องทาง LINE Chatbot กรณีศึกษา วง BNK48', 'นาย', 'พงศธร วงศ์จีน', 'มหาวิทยาลัยศิลปากร', 'Oral', 'Good'),
(222, 559, 'รูปแบบการเก็บข้อมูลของหนังสือเดินทางประเทศไทยในปัจจุบัน', 'นาย', 'สิทธิศักดิ์ ธรรมบวร', 'สถาบันเทคโนโลยีพระจอมเกล้าเจ้าคุณทหารลาดกระบัง', 'Poster', 'Very Good'),
(223, 562, 'ต้นแบบการตรวจจับท่าวิ่งที่ส่งผลต่อการบาดเจ็บ', 'นาย', 'วันชัย เทียนธนะวัฒน์', 'มหาวิทยาลัยศิลปากร', 'Oral', 'Excellence'),
(224, 564, 'ระบบขายสินค้าบำรุงผิวออนไลน์', 'นางสาว', 'ภัทรวรินทร์ ทองน้อย', 'มหาวิทยาลัยราชภัฏอุบลราชธานี', 'Oral', 'Good'),
(225, 565, 'เว็บแอปพลิเคชันจัดการหอพักภายในบริษัท ยูโรเปี้ยนฟู้ด จำกัด (มหาชน) ', 'นาย', 'จิรายุทธ อ๋อประเสริฐ', 'มหาวิทยาลัยราชภัฏราชนครินทร์', 'Oral', 'Good'),
(226, 566, 'การวิเคราะห์ความรู้สึกสังคมออนไลน์ที่มีต่องานวัฒนธรรมและการท่องเที่ยว ', 'นางสาว', 'วาสนา ด่านวิหาร', 'มหาวิทยาลัยบูรพา วิทยาเขตชลบุรี', 'Oral', 'Good'),
(227, 567, 'การพัฒนาระบบบริหารจัดการกลุ่มผู้ค้าส่งสำหรับเกษตรกร', 'ผู้ช่วยศาสตราจารย์ ดร.', 'เกษม ตริตระการ', 'มหาวิทยาลัยราชภัฏบ้านสมเด็จเจ้าพระยา ', 'Oral', 'Good'),
(228, 573, 'การใช้เทคนิคเหมืองข้อมูลในการพยากรณ์ปริมาณน้ำในเขื่อนปราณบุรี', 'นาย', 'ศุภกิจ สีเมฆ,มนัสพล ยื่นกระโทก', 'มหาวิทยาลัยเทคโนโลยีราชมงคลรัตนโกสินทร์ วิทยาเขตวังไกลกังวล', 'Oral', 'Good'),
(229, 576, 'ระบบบริหารจัดการความรู้', 'นาย', 'ธีระวัฒน์ อุทธิสาร', 'มหาวิทยาลัยราชภัฏอุบลราชธานี', 'Poster', 'Good'),
(230, 578, 'Krok Phra Hospital System', 'นาวสาว', 'วิภาดา สินพูล', 'มหาวิทยาลัยราชภัฏนครสวรรค์', 'Oral', 'Good'),
(231, 581, 'การรู้จำเสียงพูดด้วยไมโครคอนโทรลเลอร์ สำหรับการตรวจสอบเหตุการณ์ผิดปกติภายในโรงเรียน', 'นาย', 'นัฐพล นนทะศรี', 'มหาวิทยาลัยเกษตรศาสตร์ วิทยาเขตเฉลิมพระเกียรติ จังหวัดสกลนคร', 'Oral', 'Best'),
(232, 582, 'การพัฒนาต้นแบบการประยุกต์ใช้เทคโนโลยีสารสนเทศ เพื่อสนับสนุนการท่องเที่ยวโดยชุมชน: กรณีศึกษาชุมชนชุมแสง อำเภอชุมแสง จังหวัดนครสวรรค์', 'นางสาว', 'อุบลวรรณ โพธิ์ดี', 'มหาวิทยาลัยราชภัฏพิบูลสงคราม', 'Poster', 'Good'),
(233, 584, 'เว็บแอปพลิเคชันการจัดการการออกแบบและขายส่งบรรจุภัณฑ์', 'นางสาว', 'จีรญา ยวงกระโทก', 'มหาวิทยาลัยเทคโนโลยีพระจอมเกล้าพระนครเหนือ วิทยาเขตปราจีนบุรี', 'Oral', 'Very Good'),
(234, 588, 'เว็บแอปพลิเคชันเพื่อการเรียนรู้ด้านเกษตรสำหรับเยาวชน', 'นางสาว ', '  พัฑฒิดา ตาดไธสง', 'มหาวิทยาลัยขอนแก่น', 'Oral', 'Good'),
(235, 589, 'การตรวจสอบคุณภาพของเมล็ดถั่วลิสง (PEANUT SEED QUALITY INSPECTION)', 'นางสาว', 'ธารณา  บุญวงศ์ทะ', 'มหาวิทยาลัยขอนแก่น', 'Oral', 'Very Good'),
(236, 593, 'Technology Acceptance and Online Consumer Behavior Affecting Consumers\' Purchasing Decisions Via the Shopee Application in Nakhon Ratchasima Municipality.', 'นาย', 'นันธวัฒน์ ทองภิระ', 'มหาวิทยาลัยเทคโนโลยีราชมงคลอีสาน วิทยาเขตนครราชสีมา', 'Oral', 'Very Good'),
(237, 595, 'ระบบสารสนเทศสำหรับการจัดการร้านขายของชำ', 'นางสาว', 'เยาวภา นาคใหม่', 'มหาวิทยาลัยเทคโนโลยีพระจอมเกล้าพระนครเหนือ วิทยาเขตปราจีนบุรี', 'Oral', 'Good'),
(238, 596, 'KU.CSC. Place Notify App', 'นาย', 'ศุภกฤต ภาดี', 'มหาวิทยาลัยเกษตรศาสตร์ วิทยาเขตเฉลิมพระเกียรติ จังหวัดสกลนคร', 'Oral', 'Good'),
(239, 597, 'ระบบเฝ้าระวังการใช้งานคอมพิวเตอร์เพื่อสุขภาพโดยใช้คอมพิวเตอร์วิทัศน์', 'นาย', 'ธีรพงษ์ สังข์ศรี', 'มหาวิทยาลัยราชภัฏนครราชสีมา', 'Oral', 'Very Good'),
(240, 600, 'การพัฒนาระบบการให้บริการเบิก – จ่ายวัสดุของสำนักงานทรัพย์สินส่วนพระมหากษัตริย์', 'นาย', 'ธนวัฒน์ ผดุงวิทย์', 'มหาวิทยาลัยเทคโนโลยีราชมงคลรัตนโกสินทร์ วิทยาเขตบพิตรพิมุข จักรวรรดิ', 'Oral', 'Good'),
(241, 601, 'เกมทายศัพท์หรรษา', 'นางสาว', 'สุมินตรา ปวงใจ', 'มหาวิทยาลัยราชภัฏเชียงราย', 'Oral', 'Good'),
(242, 603, 'Software for Enterprise Resource Planning  ', 'นาย', 'พีรพล มงคลคูณ', 'มหาวิทยาลัยบูรพา วิทยาเขตชลบุรี', 'Oral', 'Very Good'),
(243, 610, 'Development of Digital Art Community Website by Responsive Web Design', 'นาย', 'กันตภณ บุญเจียม', 'มหาวิทยาลัยเทคโนโลยีราชมงคลรัตนโกสินทร์ วิทยาเขตบพิตรพิมุข จักรวรรดิ', 'Oral', 'Good'),
(244, 611, 'ปรับปรุงระบบจัดการศูนย์เหล็ก : ส่วนบันทึกข้อมูลรายการบรรจุภัณฑ์สินค้า', 'นาย', 'อรรถพล บุญเพ็ญ', 'มหาวิทยาลัยบูรพา วิทยาเขตชลบุรี', 'Oral', 'Good'),
(245, 613, 'การพัฒนาไลน์บอทเพื่อตรวจสอบและแจ้งเตือนค่าหอพัก', 'นางสาว', 'กัญญาวีร์ เกลื่อนกล่น', 'มหาวิทยาลัยราชภัฏพิบูลสงคราม', 'Oral', 'Good'),
(246, 614, 'การพัฒนาเว็บแอปพลิเคชันแนะนำเส้นทางปั่นจักรยาน อำเภอทุ่งสง จังหวัดนครศรีธรรมราช', 'นาย', 'วชากร  ทวีโชติวรกุล ', 'มหาวิทยาลัยเทคโนโลยีราชมงคลศรีวิชัย วิทยาเขตนครศรีธรรมราช', 'Poster', 'Good'),
(247, 615, '“DRU Community” CHAT APPLICATION ON ANDROID OPERATING SYSTEM', 'นาย', 'ปฏิพล ใจเย็น', 'มหาวิทยาลัยราชภัฏธนบุรี', 'Oral', 'Good'),
(248, 618, 'แอปพลิเคชันจัดการท่องเที่ยวโดยชุมชน', 'นาย', 'วันชัย หล้าภิระ', 'มหาวิทยาลัยราชภัฏเชียงราย', 'Oral', 'Good'),
(249, 619, 'ต้นแบบตัวประเมินผล Usability Test โดยอารมณ์บนใบหน้าและการคลิกเมาส์ (The Prototype of The Usability Test Evaluation system by analysis from Facial Emotions and mouse click)', 'นาย', 'ประวิทย์ สมาคม', 'มหาวิทยาลัยศิลปากร', 'Oral', 'Excellence'),
(250, 622, 'ออกแบบ และพัฒนาระบบงานพัสดุ ครุภัณฑ์สำหรับงานโรงเรียน DESIGN AND DEVELOPMENT THE SCHOOL INVENTORY MANAGEMENT SYSTEM', 'นาย', 'วิญญู คำวงษ์', 'มหาวิทยาลัยบูรพา วิทยาเขตชลบุรี', 'Oral', 'Very Good'),
(251, 623, 'แอนิเมชันตัวอย่างเกม 3 มิติ เรื่อง Magic Stone', 'นาย', 'เกียรติฉัตร ภูมีศรี', 'มหาวิทยาลัยราชภัฏอุบลราชธานี', 'Oral', 'Good'),
(252, 624, 'สื่อโมชั่นกราฟิก 2 มิติ เรื่องโรคไข้เลือดออก', 'นาย', 'เจนภพ ส่องแสง', 'มหาวิทยาลัยราชภัฏอุบลราชธานี', 'Oral', 'Good'),
(253, 625, 'สื่อแอนิเมชัน 3 มิติ เรื่อง นากินี', 'นาย', 'ณัฐวุฒิ มะโนรา', 'มหาวิทยาลัยราชภัฏอุบลราชธานี', 'Oral', 'Good'),
(254, 627, 'การใช้เทคโนโลยีโพลีกอตในระบบการขายพาณิชย์อิเล็กทรอนิกส์ กรณีศึกษา ระบบการขายผักปลอดสารพิษ (A Polyglot Persistence approach for E-Commerce business model : Case Study Pesticide residue free vegetable sales system', 'นาย', 'พงษ์ศักดิ์ เพชรมา', 'มหาวิทยาลัยศิลปากร', 'Oral', 'Good'),
(255, 631, 'แอปพลิเคชันแนะนำสถานที่ท่องเที่ยวจังหวัดฉะเชิงเทรา', 'นาย', 'วงศธร จิตรวิไลย', 'มหาวิทยาลัยสวนดุสิต', 'Oral', 'Good'),
(256, 632, 'แอปพลิเคชัน AR ไหว้พระ 9 วัด ริมแม่น้ำเจ้าพระยา', 'นาย', 'สิริชัย เฮงอาภรณ์', 'มหาวิทยาลัยสวนดุสิต', 'Oral', 'Good'),
(257, 633, 'The augmented reality system of tourist attractions in Bangkok, BTS line', 'นางสาว', 'กัลยรัตน์ สายพวรรณ์', 'มหาวิทยาลัยเกษตรศาสตร์ วิทยาเขตกำแพงแสน', 'Poster', 'Very Good'),
(258, 634, 'The Virtual Reality System of tourist attractions in Kanchanaburi.', 'นาย', 'ชยานันท์ พิณนอก', 'มหาวิทยาลัยเกษตรศาสตร์ วิทยาเขตกำแพงแสน', 'Poster', 'Good'),
(259, 635, 'Virtual reality system of tourist attractions in Pathum Thani Province', 'นางสาว', 'อรกมล เติมทอง', 'มหาวิทยาลัยเกษตรศาสตร์ วิทยาเขตกำแพงแสน', 'Poster', 'Good'),
(260, 636, 'The virtual reality system of museum attractions in Bangkok', 'นางสาว', 'สุภาพร สุขสวัสดิ์', 'มหาวิทยาลัยเกษตรศาสตร์ วิทยาเขตกำแพงแสน', 'Poster', 'Good'),
(261, 637, 'Application recommends 10 restaurants along the BTS skytrain With virtual technology ', 'นางสาว', 'กวิสรา ภักดีนอก', 'มหาวิทยาลัยเกษตรศาสตร์ วิทยาเขตกำแพงแสน', 'Poster', 'Good'),
(262, 638, 'The Virtual Reality System of tourist attractions in Nonthaburi', 'นางสาว', 'ภัทรนันท์ รัตนมณีศีลป์', 'มหาวิทยาลัยเกษตรศาสตร์ วิทยาเขตกำแพงแสน', 'Poster', 'Good'),
(263, 639, 'Application to Introduce Location of Nakhon Pathom with Augmented Reality', 'นางสาว', 'วิยะดา วีระอัจฉราพรรณ', 'มหาวิทยาลัยเกษตรศาสตร์ วิทยาเขตกำแพงแสน', 'Poster', 'Good'),
(264, 640, 'Augmented Reality system of tourist attractions in Bangkok along MRT subway line', 'นางสาว', 'สุกัญญา  กลมสม', 'มหาวิทยาลัยเกษตรศาสตร์ วิทยาเขตกำแพงแสน', 'Poster', 'Good'),
(265, 641, 'Virtual reality system of tourist attractions, Bangkok', 'นาย', 'อนุชา เกรียงยงค์', 'มหาวิทยาลัยเกษตรศาสตร์ วิทยาเขตกำแพงแสน', 'Oral', 'Good'),
(266, 643, 'English Guessing Game on Android Operating System', 'เกมทายภาพ', 'ปฏิวัติ พรวนมูล', 'มหาวิทยาลัยราชภัฏอุตรดิตถ์', 'Poster', 'Very Good'),
(267, 647, 'The Access Control Module with Internet of Things Technology', 'นาย', 'เขมชาติ เจริญชนาพร', 'มหาวิทยาลัยเทคโนโลยีราชมงคลสุวรรณภูมิ ศูนย์สุพรรณบุรี', 'Oral', 'Good'),
(268, 650, 'ระบบแชทบอทนัดหมายแพทย์', 'นางสาว', 'พลอยนิสา กฤษสร้อยสน', 'มหาวิทยาลัยเกษตรศาสตร์ วิทยาเขตศรีราชา', 'Oral', 'Very Good'),
(269, 651, 'การพัฒนาโมบายแอพพลิเคชั่นสำหรับค้นหาร้านอาหารโดยอาศัยคลาวด์', 'นางสาว', 'ศิริลักษณ์ ทับทิม', 'มหาวิทยาลัยเกษตรศาสตร์ วิทยาเขตกำแพงแสน', 'Poster', 'Good'),
(270, 652, 'การพัฒนาแอพพลิเคชั่นงานเกษตรกำแพงแสนโดยอาศัยคลาวด์', 'นางสาว', 'สิริกมล เขียวอร่าม', 'มหาวิทยาลัยเกษตรศาสตร์ วิทยาเขตกำแพงแสน', 'Poster', 'Good'),
(271, 653, 'ต้นแบบเพื่อการสนับสนุนการตัดสินใจเลือกโรงเรียนด้วยระบบสารสนเทศภูมิศาสตร์', 'นาย', 'วุฒินันท์ วัฒนชัย', 'มหาวิทยาลัยราชภัฏพิบูลสงคราม', 'Oral', 'Good'),
(272, 657, 'ระบบสารสนเทศเพื่อสนับสนุนการปฏิบัติงานของ QA', 'นาย', 'สาริศ โสภณวัฒนเสวี', 'สถาบันเทคโนโลยีพระจอมเกล้าเจ้าคุณทหารลาดกระบัง', 'Poster', 'Good'),
(273, 659, 'เว็บแอปพลิเคชันการขอทำนามบัตร', 'นาย', 'กฤติธี ทวีสุข', 'สถาบันเทคโนโลยีพระจอมเกล้าเจ้าคุณทหารลาดกระบัง', 'Poster', 'Good'),
(274, 663, 'การพัฒนาระบบสนับสนุนการจำหน่ายผงกล้วยน้ำว้าดิบแม่อุบลของกลุ่มวิสาหกิจชุมชนกล้วยกวนกะทิสด ผ่านเว็บแอปพลิเคชันแบบตอบสนอง', 'นาย', 'อภิวัฒน์    พิมงาม', 'มหาวิทยาลัยราชภัฏนครสวรรค์', 'Oral', 'Very Good'),
(275, 666, 'การพัฒนาระบบสนับสนุนการตลาดออนไลน์ผลิตภัณฑ์ชุมชนโอทอปกุนเชียงปลาของ กลุ่มแปรรูปปลาบ้านท่าดินแดงในรูปแบบเว็บแอปพลิเคชัน ', 'นางสาว', 'ณัฐชา สำรวลรื่น', 'มหาวิทยาลัยราชภัฏนครสวรรค์', 'Oral', 'Good'),
(276, 669, 'การพัฒนาเว็บไซต์แผนที่ 360 องศา  มหาวิทยาลัยเทคโนโลยีราชมงคลอีสาน วิทยาเขตสุรินทร์', 'นางสาว', 'ศศิณา พะนิจรัมย์', 'มหาวิทยาลัยเทคโนโลยีราชมงคลอีสาน วิทยาเขตสุรินทร์', 'Poster', 'Good'),
(277, 671, 'สื่อสอนเสริมความรู้ วิชาภาษาไทย เรื่องนิทานอีสป กรณีศึกษาโรงเรียนบ้านอีสร้อย', 'นางสาว', 'ศศิณา พะนิจรัมย์', 'มหาวิทยาลัยเทคโนโลยีราชมงคลอีสาน วิทยาเขตสุรินทร์', 'Poster', 'Good'),
(278, 672, 'สื่อสอนเสริม เรื่องภัยคุกคามจากเทคโนโลยีและการป้องกัน', 'นางสาว', 'ศศิณา พะนิจรัมย์', 'มหาวิทยาลัยเทคโนโลยีราชมงคลอีสาน วิทยาเขตสุรินทร์', 'Poster', 'Good'),
(279, 674, 'การพัฒนาระบบจัดการวัสดุสำนักงาน คณะบริหารธุรกิจ (ศาลายา) มหาวิทยาลัยเทคโนโลยีราชมงคลรัตนโกสินทร์', 'นาย', 'จามร นิตยศร', 'มหาวิทยาลัยเทคโนโลยีราชมงคลรัตนโกสินทร์ วิทยาเขตศาลายา', 'Oral', 'Good'),
(280, 677, 'Application for Promoting Tourism of Samut Prakarn Province', 'นางสาว', 'นิศากร เถาสมบัติ', 'มหาวิทยาลัยราชภัฏบ้านสมเด็จเจ้าพระยา ', 'Oral', 'Good'),
(281, 678, 'Life Insurance Policy Management System on Web Application', 'นาย', 'ยุทธนา สุดแสงจันทร์', 'สถาบันเทคโนโลยีพระจอมเกล้าเจ้าคุณทหารลาดกระบัง', 'Poster', 'Good'),
(282, 681, 'Service Fee Upload System for Agent', 'นาย', 'อรรคเมษ รอดรักษ์', 'สถาบันเทคโนโลยีพระจอมเกล้าเจ้าคุณทหารลาดกระบัง', 'Poster', 'Very Good'),
(283, 682, 'โปรแกรมคอมพิวเตอร์สำหรับตรวจแบบสอบถามโดยใช้ภาพถ่าย', 'นาย', 'สุรพล เคล้าเครือ ', 'มหาวิทยาลัยราชภัฏนครราชสีมา', 'Oral', 'Good'),
(284, 683, 'A Fun Multimedia English Vocabulary Matching Game for Prathomsuksa 1', 'นางสาว', 'ธัญญารัตน์ แก้วบัวดี', 'มหาวิทยาลัยเทคโนโลยีราชมงคลสุวรรณภูมิ ศูนย์สุพรรณบุรี', 'Oral', 'Very Good'),
(285, 687, 'การพัฒนาระบบการสั่งอาหาร  กรณีศึกษา ร้านอาหารคันทรีเลิฟทุ่งสง จ.นครศรีธรรมราช', 'นางสาว', 'จารุวรรณ เกตุบูรณะ', 'มหาวิทยาลัยเทคโนโลยีราชมงคลศรีวิชัย วิทยาเขตนครศรีธรรมราช', 'Poster', 'Good'),
(286, 691, 'การ์ตูนแอนิเมชัน 2 มิติ เรื่อง สะดวก สบาย แต่ทำลายโลก', 'นางสาว', 'เปมิกา แสนประสิทธิ์', 'มหาวิทยาลัยสวนดุสิต', 'Oral', 'Good'),
(287, 702, 'An End-to-End Trainable Thai OCR System Using Deep Recurrent Neural Network', 'นาย', 'รัฐศาสตร์ เฮงประเสริฐ', 'มหาวิทยาลัยเกษตรศาสตร์ วิทยาเขตกำแพงแสน', 'Oral', 'Good'),
(288, 704, 'การออกแบบและพัฒนาเกมคอมพิวเตอร์ 2 มิติ วิ่งทะลุวงกต', 'นาย', 'อัมรินทร์ อินทร์ทิพย์', 'มหาวิทยาลัยราชภัฏพิบูลสงคราม', 'Oral', 'Good'),
(289, 705, 'เกมคณิตศาสตร์ผจญภัย', 'นาย', 'ชัยกิตติ์ พิพัฒน์ผลสกุล', 'มหาวิทยาลัยสวนดุสิต', 'Oral', 'Good'),
(290, 709, 'ระบบจัดการจองพื้นที่จำหน่ายสินค้าของตลาดไนท์', 'นาย', 'จิรายุทธ รูปสูง', 'มหาวิทยาลัยราชภัฏมหาสารคาม', 'Oral', 'Good'),
(291, 711, 'การพัฒนาระบบแนะนำสินค้าหลุดจำนำ โรงรับจำนำไทย ', 'นางสาว', 'จุฬาลักษณ์ บาลรัมย์', 'มหาวิทยาลัยราชภัฏมหาสารคาม', 'Oral', 'Good'),
(292, 717, 'ระบบจัดการบัญชีออนไลน์เพื่อธุรกิจวิสาหกิจขนาดกลางและขนาดย่อม', 'นาย', 'อดิศักดิ์ กนกสิงห์', 'มหาวิทยาลัยเทคโนโลยีราชมงคลรัตนโกสินทร์ วิทยาเขตบพิตรพิมุข จักรวรรดิ', 'Oral', 'Good'),
(293, 721, 'Detect Prohibited items in Classroom by Deep Learning', 'นาย', 'อนันตธรรม ระงับภัย', 'มหาวิทยาลัยเกษตรศาสตร์ วิทยาเขตกำแพงแสน', 'Oral', 'Very Good'),
(294, 725, 'แอปพลิเคชันติดตามเส้นทางการเดินทางของรถบัส', 'นาย', 'ธนะพล ทัฬหะวาสน์', 'มหาวิทยาลัยสงขลานครินทร์ หาดใหญ่', 'Oral', 'Excellence'),
(295, 727, 'Lighting Automation Using Google Assistant', 'นาย', 'กฤตพล พันสีนาม', 'มหาวิทยาลัยสวนดุสิต', 'Oral', 'Good'),
(296, 728, 'ระบบจัดการการประเมินผลการปฏิบัติงานของบุคลากรในมหาวิทยาลัย', 'นาย', 'ณัฐพล ไชยวงค์', 'มหาวิทยาลัยราชภัฏเชียงราย', 'Oral', 'Very Good'),
(297, 729, 'In-room electrical equipments control system by using Internet of Things', 'นาย', 'กฤษฎ์ มีสิมมา', 'มหาวิทยาลัยราชภัฏบ้านสมเด็จเจ้าพระยา ', 'Oral', 'Excellence'),
(298, 731, 'การปรับปรุงทะเบียนทรัพย์สิน-ที่ดิน อาคาร อุปกรณ์(สุทธิ) ในระบบ SAP', 'นาย', 'ปารุตม์  ศรีหมาตร์', 'สถาบันเทคโนโลยีพระจอมเกล้าเจ้าคุณทหารลาดกระบัง', 'Poster', 'Good'),
(299, 732, 'แอปพลิเคชันแนะนำช่างแต่งหน้าในกรุงเทพมหานคร', 'นางสาว', 'กัญญารัตน์ ฤกษ์ดี', 'มหาวิทยาลัยสวนดุสิต', 'Oral', 'Very Good'),
(300, 734, 'Incubator to Control Temperature the Egg Back Automatically', 'นาย', 'สุทธิพงษ์ มุลทาเย็น', 'มหาวิทยาลัยเกษตรศาสตร์ วิทยาเขตเฉลิมพระเกียรติ จังหวัดสกลนคร', 'Oral', 'Excellence'),
(301, 735, 'การใช้ TDD ในการพัฒนาระบบการลาออนไลน์', 'นางสาว', 'สุดารัตน์  สอนใจ', 'มหาวิทยาลัยเทคโนโลยีราชมงคลรัตนโกสินทร์ วิทยาเขตบพิตรพิมุข จักรวรรดิ', 'Oral', 'Very Good'),
(302, 738, 'การพัฒนาระบบหนังสือเวียน ของสาขาวิชาเทคโนโลยีสารสนเทศทางธุรกิจ มหาวิทยาลัยเทคโนโลยีราชมงคลรัตนโกสินทร์', 'นาย', 'พิชญุตม์ วุฒิเวโรจน์', 'มหาวิทยาลัยเทคโนโลยีราชมงคลรัตนโกสินทร์ วิทยาเขตศาลายา', 'Oral', 'Good'),
(303, 739, 'Using Internet of Things for Industry Case Study on Counting Cans in Production Packaging Systems', 'ดร.', 'ชิดชนก โชคสุชาติ', 'มหาวิทยาลัยสงขลานครินทร์ หาดใหญ่', 'Oral', 'Very Good');
INSERT INTO `award` (`table_name_id`, `h1`, `h2`, `h3`, `h4`, `h5`, `h6`, `h7`) VALUES
(304, 742, 'ระบบการจัดการวัสดุ/อุปกรณ์ ครุภัณฑ์ในสำนักคอมพิวเตอร์และเทคโนโลยีสารสนเทศ โดยใช้ NodeJs', 'นาย', 'พงศธร อารักคิด', 'มหาวิทยาลัยราชภัฏเชียงราย', 'Oral', 'Good'),
(305, 743, 'การวิเคราะห์คุณภาพข้าวไรซ์เบอร์รี่จากภาพถ่าย ด้วยคุณลักษณะสี', 'นางสาว', 'ชลธิชา พินิจ', 'มหาวิทยาลัยราชภัฏพิบูลสงคราม', 'Oral', 'Very Good'),
(306, 744, 'ระบบการตรวจจับภาพสำหรับการตรวจจับหมวกกันน็อค', 'นางสาว', 'เกวลี นาราสุนทรกุล', 'มหาวิทยาลัยเกษตรศาสตร์ วิทยาเขตกำแพงแสน', 'Oral', 'Good'),
(307, 746, 'Webboard of Bridge Sports for Learners', 'ดร.', 'ชิดชนก โชคสุชาติ', 'มหาวิทยาลัยสงขลานครินทร์ หาดใหญ่', 'Oral', 'Good'),
(308, 747, 'ระบบธนาคารการจัดการขยะชุมชนด้วยเทคโนโลยี IIOT (Bank System for Community Waste Management with IIOT)', 'นาย', 'ธีระพล ดีฉาย', 'มหาวิทยาลัยราชภัฎพระนครศรีอยุธยา', 'Oral', 'Excellence'),
(309, 748, 'Application Management Fish Feeder with Android operating system', 'นางสาว', 'ลูกหนู อู่ทอง', 'มหาวิทยาลัยเทคโนโลยีราชมงคลสุวรรณภูมิ ศูนย์สุพรรณบุรี', 'Oral', 'Very Good'),
(310, 750, 'ระบบติดตามและบันทึกข้อมูลการปฏิบัติงานนอกสถานที่', 'นาย', 'ภควัต สมุทนคุณ', 'มหาวิทยาลัยบูรพา วิทยาเขตชลบุรี', 'Oral', 'Very Good'),
(311, 752, 'เว็บแอปพลิเคชันคลินิกความงามและผิวพรรณหมอเพื่อน (Professional Dermatologist Web Application)', 'นาวสาว', 'ณัฐติกานต์ ขันชัยภูมิ', 'มหาวิทยาลัยขอนแก่น', 'Oral', 'Good'),
(312, 759, 'การพัฒนาระบบการจองที่พักรีสอร์ทบ้านไร่ภูอิเกิ้ง ', 'นาย', 'อรรถพล ชมญาติ', 'มหาวิทยาลัยราชภัฏชัยภูมิ', 'Oral', 'Good'),
(313, 761, 'การพัฒนาแอปพลิเคชันจับคู่งาน', 'นาย', 'ยุทธนา มาตัน', 'มหาวิทยาลัยราชภัฏเชียงราย', 'Oral', 'Very Good'),
(314, 762, 'ระบบสารสนเทศเพื่อการจัดการด้านประกันคุณภาพการศึกษา คณะวิทยาการจัดการ มหาวิทยาลัยราชภัฏนครสวรรค์', 'นางสาว,นางสาว,นางสาว', 'อัยรัตน์ ศักดิ์ทอง', 'มหาวิทยาลัยราชภัฏนครสวรรค์', 'Poster', 'Good'),
(315, 766, 'โปรแกรมตรวจสอบยางรถจักรยานยนต์ที่ผิดปกติด้วยภาพ', 'นางสาว', 'จรัสศรี รุ่งรัตนาอุบล', 'มหาวิทยาลัยนเรศวร', 'Oral', 'Very Good'),
(316, 767, 'แชทบอทให้คำปรึกษาและแจ้งเตือนสำหรับบำบัดโรคเกาต์', 'นางสาว', 'ดวงเดือน อัศวสุธีรกุล', 'มหาวิทยาลัยนเรศวร', 'Oral', 'Very Good'),
(317, 768, 'ระบบวินิจฉัยโรคทั่วไปโดยแชทบอท', 'นาย', 'กิจติชัย ไผ่โสภา', 'มหาวิทยาลัยนเรศวร', 'Oral', 'Excellence'),
(318, 771, 'Wandee Pattana Co., Ltd. Management System', 'นางสาว', 'วราพร ภูคำศักดิ์', 'มหาวิทยาลัยเทคโนโลยีราชมงคลอีสาน วิทยาเขตนครราชสีมา', 'Oral', 'Good'),
(319, 772, 'การพัฒนาแอพพลิเคชั่นการสั่งซื้อแก๊สออนไลน์โดยใช้การระบุตำแหน่ง', 'นางสาว', 'สุพิชฌา มณีโชติ', 'มหาวิทยาลัยเทคโนโลยีราชมงคลอีสาน วิทยาเขตนครราชสีมา', 'Oral', 'Very Good'),
(320, 775, 'ระบบเลือกตั้งนายกสโมสรนักศึกษาผ่านแอปพลิเคชันบนอุปกรณ์เคลื่อนที่ระบบปฏิบัติการแอนดรอยด์ คณะเทคโนโลยีสารสนเทศ มหาวิทยาลัยราชภัฏมหาสารคาม', 'นาย', 'อรรถพล จิตต์ไม่งง', 'มหาวิทยาลัยราชภัฏมหาสารคาม', 'Poster', 'Good'),
(321, 921, 'แอพพลิเคชันกระเป๋าเงินอิเล็กทรอนิกส์บนบล็อกเชน', 'นางสาว', 'ธาดา ใจประดิษฐ์', 'มหาวิทยาลัยเทคโนโลยีราชมงคลสุวรรณภูมิ ศูนย์วาสุกรี', 'Oral', 'Good');

-- --------------------------------------------------------

--
-- Table structure for table `task_user`
--

CREATE TABLE `task_user` (
  `task_user_id` int(11) NOT NULL COMMENT 'PK',
  `user_id` varchar(10) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL COMMENT 'ไอดีผู้ใช้',
  `task_name` varchar(255) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COMMENT='ตารางเก็บความสัมพันระหว่างงานกับผู้ใช้';

--
-- Dumping data for table `task_user`
--

INSERT INTO `task_user` (`task_user_id`, `user_id`, `task_name`) VALUES
(1, '666', 'award');

-- --------------------------------------------------------

--
-- Table structure for table `template_tb`
--

CREATE TABLE `template_tb` (
  `template_id` int(11) NOT NULL,
  `task_user_id` int(11) NOT NULL,
  `colum_name` varchar(100) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `datatype` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `template_tb`
--

INSERT INTO `template_tb` (`template_id`, `task_user_id`, `colum_name`, `datatype`) VALUES
(1, 1, 'ID', 'int'),
(2, 1, 'Title', 'varchar(255)'),
(3, 1, 'Prefix', 'varchar(255)'),
(4, 1, 'Name', 'varchar(255)'),
(5, 1, 'University', 'varchar(255)'),
(6, 1, 'Type', 'varchar(255)'),
(7, 1, 'Awards', 'varchar(255)');

-- --------------------------------------------------------

--
-- Table structure for table `test_add_log`
--

CREATE TABLE `test_add_log` (
  `table_name_id` int(11) NOT NULL,
  `h1` int(11) NOT NULL,
  `h2` double NOT NULL,
  `h3` double NOT NULL,
  `h4` double NOT NULL,
  `h5` double NOT NULL,
  `h6` double NOT NULL,
  `h7` date NOT NULL,
  `h8` date NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- --------------------------------------------------------

--
-- Table structure for table `token_line`
--

CREATE TABLE `token_line` (
  `id` int(11) NOT NULL,
  `token` varchar(255) NOT NULL,
  `task_id` int(11) NOT NULL,
  `id_user` int(11) NOT NULL,
  `namegroup_line` varchar(255) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `token_line`
--

INSERT INTO `token_line` (`id`, `token`, `task_id`, `id_user`, `namegroup_line`) VALUES
(1, 'TxUHcdN16Dtlvoj4YyDRAbABEDAZHiJBXwZnEZLw8uQ', 1, 666, 'alert bot');

-- --------------------------------------------------------

--
-- Table structure for table `userpea`
--

CREATE TABLE `userpea` (
  `id_pea` int(11) NOT NULL,
  `username` int(10) NOT NULL COMMENT 'username',
  `system_level` int(11) NOT NULL,
  `status` int(1) NOT NULL COMMENT 'สถานะการใช้งาน 0 = ปิด, 1 = เปิด'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Dumping data for table `userpea`
--

INSERT INTO `userpea` (`id_pea`, `username`, `system_level`, `status`) VALUES
(1, 505972, 0, 1),
(666, 6666, 0, 1);

-- --------------------------------------------------------

--
-- Table structure for table `user_log`
--

CREATE TABLE `user_log` (
  `log_id` int(11) NOT NULL,
  `id_user_pea` int(3) NOT NULL,
  `datetime` datetime NOT NULL,
  `log_message` varchar(255) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `user_log`
--

INSERT INTO `user_log` (`log_id`, `id_user_pea`, `datetime`, `log_message`) VALUES
(1, 666, '2020-05-18 10:38:35', 'ออกจากระบบ'),
(2, 666, '2020-05-18 10:38:51', 'เรียกข้อมูลงาน  จากระบบ'),
(3, 666, '2020-05-18 10:38:54', 'เรียกดูหน้าจัดการข้อมูลงาน'),
(4, 666, '2020-05-18 10:40:15', 'เพิ่มหัวข้องาน award'),
(5, 666, '2020-05-18 10:41:28', 'เพิ่มโทเคนไลน์ งาน award'),
(6, 666, '2020-05-18 10:41:43', 'อัพโหลดไฟล์ awards.xls งาน award'),
(7, 666, '2020-05-18 10:42:23', 'เรียกดูหน้าจัดการข้อมูลงาน'),
(8, 666, '2020-05-18 10:42:37', 'เรียกดูข้อมูลส่งไลน์'),
(9, 666, '2020-05-18 10:42:59', 'เรียกข้อมูลงาน award จากระบบ'),
(10, 666, '2020-05-18 10:43:17', 'เรียกข้อมูลงาน award จากระบบ'),
(11, 666, '2020-05-18 10:43:31', 'เรียกข้อมูลงาน award จากระบบ'),
(12, 666, '2020-05-18 10:43:42', 'เรียกข้อมูลงาน award จากระบบ'),
(13, 666, '2020-05-18 10:44:19', 'เรียกข้อมูลงาน award จากระบบ'),
(14, 666, '2020-05-18 10:44:55', 'บันทึกรูปแบบงาน award ชื่อไฟล์ 1589773495_award.json'),
(15, 666, '2020-05-18 10:45:13', 'เปิดรูปแบบงานที่บันทึกไว้ชื่อ 1589773495_award.json'),
(16, 666, '2020-05-18 10:45:16', 'เรียกข้อมูลงาน award จากระบบ'),
(17, 666, '2020-05-18 10:45:19', 'เรียกข้อมูลงาน award จากระบบ'),
(18, 666, '2020-05-18 10:45:22', 'เรียกข้อมูลงาน award จากระบบ'),
(19, 666, '2020-05-18 10:45:43', 'เรียกข้อมูลงาน award จากระบบ'),
(20, 666, '2020-05-18 10:45:45', 'เรียกข้อมูลงาน award จากระบบ'),
(21, 666, '2020-05-18 10:49:05', 'เรียกข้อมูลงาน award จากระบบ'),
(22, 666, '2020-05-18 10:49:07', 'เรียกข้อมูลงาน award จากระบบ'),
(23, 666, '2020-05-18 10:49:19', 'บันทึกรูปแบบงาน award ชื่อไฟล์ 1589773759_award.json'),
(24, 666, '2020-05-18 10:49:23', 'เปิดรูปแบบงานที่บันทึกไว้ชื่อ 1589773759_award.json'),
(25, 666, '2020-05-18 10:50:21', 'เปิดรูปแบบงานที่บันทึกไว้ชื่อ 1589773759_award.json'),
(26, 666, '2020-05-18 10:50:35', 'เรียกข้อมูลงาน award จากระบบ'),
(27, 666, '2020-05-18 10:52:08', 'เปิดรูปแบบงานที่บันทึกไว้ชื่อ 1589773759_award.json'),
(28, 666, '2020-05-18 10:52:11', 'เรียกข้อมูลงาน award จากระบบ'),
(29, 666, '2020-05-18 10:52:34', 'เปิดรูปแบบงานที่บันทึกไว้ชื่อ 1589773759_award.json'),
(30, 666, '2020-05-18 10:52:37', 'เรียกข้อมูลงาน award จากระบบ'),
(31, 666, '2020-05-18 10:53:43', 'เปิดรูปแบบงานที่บันทึกไว้ชื่อ 1589773759_award.json'),
(32, 666, '2020-05-18 10:53:47', 'เรียกข้อมูลงาน award จากระบบ'),
(33, 666, '2020-05-18 10:54:29', 'เปิดรูปแบบงานที่บันทึกไว้ชื่อ 1589773759_award.json'),
(34, 666, '2020-05-18 10:54:30', 'เรียกข้อมูลงาน award จากระบบ'),
(35, 666, '2020-05-18 10:55:00', 'เปิดรูปแบบงานที่บันทึกไว้ชื่อ 1589773759_award.json'),
(36, 666, '2020-05-18 10:55:01', 'เรียกข้อมูลงาน award จากระบบ'),
(37, 666, '2020-05-18 10:57:08', 'เปิดรูปแบบงานที่บันทึกไว้ชื่อ 1589773759_award.json'),
(38, 666, '2020-05-18 10:57:14', 'เรียกข้อมูลงาน award จากระบบ'),
(39, 666, '2020-05-18 10:59:20', 'เปิดรูปแบบงานที่บันทึกไว้ชื่อ 1589773759_award.json'),
(40, 666, '2020-05-18 10:59:26', 'เรียกข้อมูลงาน award จากระบบ'),
(41, 666, '2020-05-18 11:00:05', 'เปิดรูปแบบงานที่บันทึกไว้ชื่อ 1589773759_award.json'),
(42, 666, '2020-05-18 11:00:07', 'เรียกดูข้อมูลส่งไลน์'),
(43, 666, '2020-05-18 11:00:36', 'เปิดรูปแบบงานที่บันทึกไว้ชื่อ 1589773759_award.json'),
(44, 666, '2020-05-18 11:00:37', 'เรียกข้อมูลงาน award จากระบบ'),
(45, 666, '2020-05-18 11:01:05', 'เปิดรูปแบบงานที่บันทึกไว้ชื่อ 1589773759_award.json'),
(46, 666, '2020-05-18 11:01:19', 'เรียกข้อมูลงาน award จากระบบ'),
(47, 666, '2020-05-18 11:02:12', 'เปิดรูปแบบงานที่บันทึกไว้ชื่อ 1589773759_award.json'),
(48, 666, '2020-05-18 11:02:13', 'เรียกข้อมูลงาน award จากระบบ'),
(49, 666, '2020-05-18 11:19:25', 'เปิดรูปแบบงานที่บันทึกไว้ชื่อ 1589773759_award.json'),
(50, 666, '2020-05-18 11:19:26', 'เรียกข้อมูลงาน award จากระบบ'),
(51, 666, '2020-05-18 11:21:09', 'เปิดรูปแบบงานที่บันทึกไว้ชื่อ 1589773759_award.json'),
(52, 666, '2020-05-18 11:21:09', 'เรียกข้อมูลงาน award จากระบบ'),
(53, 666, '2020-05-18 11:22:51', 'เปิดรูปแบบงานที่บันทึกไว้ชื่อ 1589773759_award.json'),
(54, 666, '2020-05-18 11:22:55', 'เรียกข้อมูลงาน award จากระบบ'),
(55, 666, '2020-05-18 11:23:56', 'เปิดรูปแบบงานที่บันทึกไว้ชื่อ 1589773759_award.json'),
(56, 666, '2020-05-18 11:24:00', 'เรียกข้อมูลงาน award จากระบบ'),
(57, 666, '2020-05-18 11:25:27', 'เปิดรูปแบบงานที่บันทึกไว้ชื่อ 1589773759_award.json'),
(58, 666, '2020-05-18 11:25:28', 'เรียกข้อมูลงาน award จากระบบ'),
(59, 666, '2020-05-18 14:18:01', 'เรียกดูหน้าจัดการข้อมูลงาน'),
(60, 666, '2020-05-18 14:18:03', 'เรียกดูหน้าจัดการข้อมูลงาน'),
(61, 666, '2020-05-18 14:18:10', 'เรียกดูข้อมูลส่งไลน์'),
(62, 666, '2020-05-18 14:18:12', 'เรียกดูประวัติการใช้งาน'),
(63, 666, '2020-05-18 14:18:13', 'เรียกดูข้อมูลส่งไลน์'),
(64, 666, '2020-05-18 14:18:13', 'เรียกดูประวัติการใช้งาน'),
(65, 666, '2020-05-18 14:18:20', 'เรียกดูหน้าจัดการข้อมูลงาน'),
(66, 666, '2020-05-18 14:18:23', 'เปิดรูปแบบงานที่บันทึกไว้ชื่อ 1589773759_award.json'),
(67, 666, '2020-05-18 14:18:29', 'เรียกข้อมูลงาน award จากระบบ'),
(68, 666, '2020-05-18 14:27:06', 'เปิดรูปแบบงานที่บันทึกไว้ชื่อ 1589773759_award.json'),
(69, 666, '2020-05-18 14:27:07', 'เรียกข้อมูลงาน award จากระบบ'),
(70, 666, '2020-05-18 14:31:38', 'เปิดรูปแบบงานที่บันทึกไว้ชื่อ 1589773759_award.json'),
(71, 666, '2020-05-18 14:31:43', 'เรียกข้อมูลงาน award จากระบบ'),
(72, 666, '2020-05-18 14:34:16', 'เปิดรูปแบบงานที่บันทึกไว้ชื่อ 1589773759_award.json'),
(73, 666, '2020-05-18 14:34:17', 'เรียกข้อมูลงาน award จากระบบ'),
(74, 666, '2020-05-18 14:35:27', 'เปิดรูปแบบงานที่บันทึกไว้ชื่อ 1589773759_award.json'),
(75, 666, '2020-05-18 14:35:27', 'เรียกข้อมูลงาน award จากระบบ'),
(76, 666, '2020-05-18 14:37:28', 'เปิดรูปแบบงานที่บันทึกไว้ชื่อ 1589773759_award.json'),
(77, 666, '2020-05-18 14:37:28', 'เรียกข้อมูลงาน award จากระบบ'),
(78, 666, '2020-05-18 14:38:41', 'เปิดรูปแบบงานที่บันทึกไว้ชื่อ 1589773759_award.json'),
(79, 666, '2020-05-18 14:38:42', 'เรียกข้อมูลงาน award จากระบบ'),
(80, 666, '2020-05-18 14:39:31', 'เปิดรูปแบบงานที่บันทึกไว้ชื่อ 1589773759_award.json'),
(81, 666, '2020-05-18 14:39:32', 'เรียกข้อมูลงาน award จากระบบ'),
(82, 666, '2020-05-18 14:40:17', 'เปิดรูปแบบงานที่บันทึกไว้ชื่อ 1589773759_award.json'),
(83, 666, '2020-05-18 14:40:18', 'เรียกข้อมูลงาน award จากระบบ'),
(84, 666, '2020-05-18 14:41:02', 'เปิดรูปแบบงานที่บันทึกไว้ชื่อ 1589773759_award.json'),
(85, 666, '2020-05-18 14:41:03', 'เรียกข้อมูลงาน award จากระบบ'),
(86, 666, '2020-05-18 14:41:24', 'เปิดรูปแบบงานที่บันทึกไว้ชื่อ 1589773759_award.json'),
(87, 666, '2020-05-18 14:41:28', 'เรียกข้อมูลงาน award จากระบบ'),
(88, 666, '2020-05-18 14:43:39', 'เปิดรูปแบบงานที่บันทึกไว้ชื่อ 1589773759_award.json'),
(89, 666, '2020-05-18 14:43:40', 'เรียกข้อมูลงาน award จากระบบ'),
(90, 666, '2020-05-18 14:44:15', 'เปิดรูปแบบงานที่บันทึกไว้ชื่อ 1589773759_award.json'),
(91, 666, '2020-05-18 14:44:16', 'เรียกข้อมูลงาน award จากระบบ'),
(92, 666, '2020-05-18 14:44:49', 'เปิดรูปแบบงานที่บันทึกไว้ชื่อ 1589773759_award.json'),
(93, 666, '2020-05-18 14:44:50', 'เรียกข้อมูลงาน award จากระบบ'),
(94, 666, '2020-05-18 14:45:24', 'เปิดรูปแบบงานที่บันทึกไว้ชื่อ 1589773759_award.json'),
(95, 666, '2020-05-18 14:45:25', 'เรียกข้อมูลงาน award จากระบบ'),
(96, 666, '2020-05-18 14:46:07', 'เปิดรูปแบบงานที่บันทึกไว้ชื่อ 1589773759_award.json'),
(97, 666, '2020-05-18 14:46:08', 'เรียกข้อมูลงาน award จากระบบ'),
(98, 666, '2020-05-18 14:48:36', 'เปิดรูปแบบงานที่บันทึกไว้ชื่อ 1589773759_award.json'),
(99, 666, '2020-05-18 14:48:37', 'เรียกข้อมูลงาน award จากระบบ'),
(100, 666, '2020-05-18 21:18:36', 'เปิดรูปแบบงานที่บันทึกไว้ชื่อ 1589773759_award.json'),
(101, 666, '2020-05-18 21:18:38', 'เรียกข้อมูลงาน award จากระบบ'),
(102, 666, '2020-05-18 21:25:03', 'เรียกข้อมูลงาน award จากระบบ'),
(103, 666, '2020-05-18 21:25:07', 'เปิดรูปแบบงานที่บันทึกไว้ชื่อ 1589773759_award.json'),
(104, 666, '2020-05-18 21:25:08', 'เรียกข้อมูลงาน award จากระบบ'),
(105, 666, '2020-05-18 21:25:31', 'บันทึกรูปแบบงาน award ชื่อไฟล์ 1589811931_award.json'),
(106, 666, '2020-05-18 21:25:36', 'เปิดรูปแบบงานที่บันทึกไว้ชื่อ 1589811931_award.json'),
(107, 666, '2020-05-18 21:25:37', 'เรียกข้อมูลงาน award จากระบบ'),
(108, 666, '2020-05-18 21:25:44', 'เปิดรูปแบบงานที่บันทึกไว้ชื่อ 1589773759_award.json'),
(109, 666, '2020-05-18 21:25:54', 'เปิดรูปแบบงานที่บันทึกไว้ชื่อ 1589811931_award.json'),
(110, 666, '2020-05-18 21:27:04', 'เรียกข้อมูลงาน award จากระบบ'),
(111, 666, '2020-05-18 21:31:59', 'เปิดรูปแบบงานที่บันทึกไว้ชื่อ 1589811931_award.json'),
(112, 666, '2020-05-18 21:32:05', 'เรียกข้อมูลงาน award จากระบบ'),
(113, 666, '2020-05-18 21:33:16', 'เปิดรูปแบบงานที่บันทึกไว้ชื่อ 1589811931_award.json'),
(114, 666, '2020-05-18 21:33:17', 'เปิดรูปแบบงานที่บันทึกไว้ชื่อ 1589773759_award.json'),
(115, 666, '2020-05-18 21:33:18', 'เรียกข้อมูลงาน award จากระบบ'),
(116, 666, '2020-05-18 21:35:03', 'เปิดรูปแบบงานที่บันทึกไว้ชื่อ 1589773759_award.json'),
(117, 666, '2020-05-18 21:35:03', 'เรียกข้อมูลงาน award จากระบบ'),
(118, 666, '2020-05-18 21:36:58', 'เปิดรูปแบบงานที่บันทึกไว้ชื่อ 1589811931_award.json'),
(119, 666, '2020-05-18 21:36:58', 'เรียกข้อมูลงาน award จากระบบ'),
(120, 666, '2020-05-18 21:38:12', 'เปิดรูปแบบงานที่บันทึกไว้ชื่อ 1589773759_award.json'),
(121, 666, '2020-05-18 21:38:12', 'เรียกข้อมูลงาน award จากระบบ'),
(122, 666, '2020-05-18 21:39:15', 'เปิดรูปแบบงานที่บันทึกไว้ชื่อ 1589773759_award.json'),
(123, 666, '2020-05-18 21:39:15', 'เรียกข้อมูลงาน award จากระบบ'),
(124, 666, '2020-05-18 21:40:01', 'เปิดรูปแบบงานที่บันทึกไว้ชื่อ 1589811931_award.json'),
(125, 666, '2020-05-18 21:40:01', 'เรียกข้อมูลงาน award จากระบบ'),
(126, 666, '2020-05-18 21:56:45', 'เปิดรูปแบบงานที่บันทึกไว้ชื่อ 1589773759_award.json'),
(127, 666, '2020-05-18 21:56:47', 'เรียกข้อมูลงาน award จากระบบ'),
(128, 666, '2020-05-18 21:56:51', 'เปิดรูปแบบงานที่บันทึกไว้ชื่อ 1589811931_award.json'),
(129, 666, '2020-05-18 21:56:53', 'เรียกข้อมูลงาน award จากระบบ'),
(130, 666, '2020-05-18 21:57:01', 'บันทึกข้อมูลแจ้งเตือนไลน์ งาน award'),
(131, 666, '2020-05-18 21:58:15', 'เรียกดูข้อมูลส่งไลน์'),
(132, 666, '2020-05-18 22:02:16', 'เรียกดูข้อมูลส่งไลน์'),
(133, 666, '2020-05-18 22:02:17', 'เรียกดูประวัติการใช้งาน'),
(134, 666, '2020-05-18 22:02:21', 'เรียกดูหน้าจัดการข้อมูลงาน'),
(135, 666, '2020-05-18 22:02:41', 'เปิดรูปแบบงานที่บันทึกไว้ชื่อ 1589773759_award.json'),
(136, 666, '2020-05-18 22:02:42', 'เปิดรูปแบบงานที่บันทึกไว้ชื่อ 1589811931_award.json'),
(137, 666, '2020-05-18 22:02:55', 'เปิดรูปแบบงานที่บันทึกไว้ชื่อ 1589773759_award.json'),
(138, 666, '2020-05-18 22:02:58', 'เรียกดูหน้าจัดการข้อมูลงาน'),
(139, 666, '2020-05-18 22:03:02', 'เรียกดูข้อมูลส่งไลน์'),
(140, 666, '2020-05-18 22:03:02', 'เรียกดูข้อมูลส่งไลน์'),
(141, 666, '2020-05-18 22:03:06', 'เรียกดูประวัติการใช้งาน'),
(142, 666, '2020-05-18 22:03:08', 'ออกจากระบบ'),
(143, 666, '2020-05-19 09:50:50', 'เรียกดูข้อมูลส่งไลน์'),
(144, 666, '2020-05-19 09:59:01', 'เรียกดูประวัติการใช้งาน'),
(145, 666, '2020-05-19 09:59:02', 'ออกจากระบบ'),
(146, 666, '2020-05-19 09:59:16', 'เรียกดูหน้าจัดการข้อมูลงาน'),
(147, 666, '2020-05-19 09:59:23', 'เปิดรูปแบบงานที่บันทึกไว้ชื่อ 1589773759_award.json'),
(148, 666, '2020-05-19 09:59:23', 'เปิดรูปแบบงานที่บันทึกไว้ชื่อ 1589811931_award.json'),
(149, 666, '2020-05-19 09:59:24', 'เรียกข้อมูลงาน award จากระบบ'),
(150, 666, '2020-05-19 09:59:36', 'เรียกดูข้อมูลส่งไลน์');

-- --------------------------------------------------------

--
-- Table structure for table `user_save_setting`
--

CREATE TABLE `user_save_setting` (
  `id` int(11) NOT NULL,
  `user_id` int(11) NOT NULL,
  `task_name` varchar(100) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `path` varchar(255) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `date_time` datetime NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `user_save_setting`
--

INSERT INTO `user_save_setting` (`id`, `user_id`, `task_name`, `path`, `date_time`) VALUES
(1, 666, 'award', '1589773759_award.json', '2020-05-18 10:49:19'),
(2, 666, 'award', '1589811931_award.json', '2020-05-18 21:25:31');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `alert`
--
ALTER TABLE `alert`
  ADD PRIMARY KEY (`alert_id`);

--
-- Indexes for table `alert_update_datetime`
--
ALTER TABLE `alert_update_datetime`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `award`
--
ALTER TABLE `award`
  ADD PRIMARY KEY (`table_name_id`);

--
-- Indexes for table `task_user`
--
ALTER TABLE `task_user`
  ADD PRIMARY KEY (`task_user_id`);

--
-- Indexes for table `template_tb`
--
ALTER TABLE `template_tb`
  ADD PRIMARY KEY (`template_id`);

--
-- Indexes for table `test_add_log`
--
ALTER TABLE `test_add_log`
  ADD PRIMARY KEY (`table_name_id`);

--
-- Indexes for table `token_line`
--
ALTER TABLE `token_line`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `userpea`
--
ALTER TABLE `userpea`
  ADD PRIMARY KEY (`id_pea`);

--
-- Indexes for table `user_log`
--
ALTER TABLE `user_log`
  ADD PRIMARY KEY (`log_id`);

--
-- Indexes for table `user_save_setting`
--
ALTER TABLE `user_save_setting`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `alert`
--
ALTER TABLE `alert`
  MODIFY `alert_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `alert_update_datetime`
--
ALTER TABLE `alert_update_datetime`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `award`
--
ALTER TABLE `award`
  MODIFY `table_name_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=322;

--
-- AUTO_INCREMENT for table `task_user`
--
ALTER TABLE `task_user`
  MODIFY `task_user_id` int(11) NOT NULL AUTO_INCREMENT COMMENT 'PK', AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `template_tb`
--
ALTER TABLE `template_tb`
  MODIFY `template_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=8;

--
-- AUTO_INCREMENT for table `test_add_log`
--
ALTER TABLE `test_add_log`
  MODIFY `table_name_id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `token_line`
--
ALTER TABLE `token_line`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `userpea`
--
ALTER TABLE `userpea`
  MODIFY `id_pea` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=667;

--
-- AUTO_INCREMENT for table `user_log`
--
ALTER TABLE `user_log`
  MODIFY `log_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=151;

--
-- AUTO_INCREMENT for table `user_save_setting`
--
ALTER TABLE `user_save_setting`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
